[
  {
    "id": 1078,
    "name": "Fuksiexcu: Futurice",
    "user_id": 797,
    "created": "2016-08-23T16:33:44.000Z",
    "starts": "2016-09-13T17:00:00.000Z",
    "registration_starts": "2016-09-07T12:00:00.000Z",
    "registration_ends": "2016-09-11T23:52:00.000Z",
    "cancellation_starts": "2016-09-07T12:00:00.000Z",
    "cancellation_ends": "2016-09-11T23:52:00.000Z",
    "location": "Futurice, Annankatu 34-36, Helsinki",
    "category": "Yritysvierailu",
    "description": "Hi there!\r\n\r\nFuturice is a lean service creation company. This means software development, design, and business advisory under one roof. We work with plenty of major Finnish and European companies, and there's a good chance that you've already used today some of our the products we have built together with our customers. Join the excu to hear more about the services and opportunities Futurice offers. We serve you with information, food, beverages and a little competition.\r\n\r\nSee you soon!\r\n\r\nBr, Futurice\r\n\r\n---\r\n\r\n<b>This excu is for freshmen</b>\r\n\r\nWe will leave from Kumpula as a group, leaving from Gurula at 16:15. If you have any questions, miss the group when leaving Kumpula or don't know the way to the Futurice office, you can call 040 529 2050 (Jonne Airaksinen)",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1108,
    "name": "Vuosijuhlat 2016",
    "user_id": 1168,
    "created": "2016-09-23T02:57:33.000Z",
    "starts": "2016-11-12T19:00:00.000Z",
    "registration_starts": "2016-10-18T14:00:00.000Z",
    "registration_ends": "2016-10-28T12:00:00.000Z",
    "cancellation_starts": "2016-10-18T14:00:00.000Z",
    "cancellation_ends": "2016-10-28T12:00:00.000Z",
    "location": "Kilta-sali (Lapinrinne 1)",
    "category": "Vuosijuhla",
    "description": "Sydämellisesti tervetuloa juhlimaan TKO-älyn jo 28 vuoden taipaleen juhlaa Kilta-saliin Helsingin Kamppiin 12.11.2016!\r\n\r\nIlta alkaa cocktail-tilaisuudella Alina-salissa kello 17, osoitteessa Mannerheimintie 5A, jossa on tarjolla kuohuviiniä sekä onnentoivotuksia ainejärjestöllemme. Cocktail-tilaisuuteen ovat tervetulleita kaikki iltajuhlaan osallistuvat. \r\n\r\nTilaisuuden jälkeen siirrymme Kilta-saliin, osoiteeseen Lapinrinne 1, viettämään pöytäjuhlaa, joka alkaa kello 19. Juhlan aikana nautimme maittavan menun, laulamme sitsilauluja, sekä kuulemme puheita ja musiikkiesityksiä. Illallisen jälkeen juhlat jatkuvat Alina-salissa, jossa on tarjolla pientä yöpalaa.\r\n\r\nPukukoodina frakki tai tumma puku, sekä akateemiset kunniamerkit. TKO-älyn jäsenelle osallistumishinta on 50e, johon sisältyvät illallinen, illallisen juomat, cocktail-tilaisuus sekä jatkot. Myös kuljetukset tapahtumapaikkojen välillä kuuluvat hintaan. \r\n\r\nSunnuntaiaamuna vietämme silliaamiaista klo 11 kuohuvan, naposteltavien ja saunan parissa. Paikkana on tänä vuonna kattosauna Sivistys osoitteessa Leppäsuonkatu 11. Silliaamiaisen hinta on 10e.\r\n\r\n\r\nIllallisen menu:\r\n<i>\r\nKuohkeaa maa-artisokkakeittoa, metsäsienitartar ja leipää\r\n* * *\r\n\r\nYlikypsäksi haudutettua karitsanniskaa, Waldemar-juustolla maustettua, paistettua polentaa sekä katajanmarjakastiketta\r\n\r\nTAI\r\n\r\nPaahdettua munakoisoa maapähkinäkuorrutteella ja rapeaksi paahdetulla sipulilla, lisuke tuoreista vihreistä pavuista, sokeriherneestä ja kesäkurpitsasta\r\n\r\n* * *\r\nKillan suklaakakkua, valkosuklaaganache ja vadelmaa\r\n</i>\r\n\r\nVuosijuhlista voit lukea lisää <a href=\"http://tko-aly.fi/toiminta/vuosijuhlat\">täältä</a>.\r\n\r\nNähdään vuoden parhaissa juhlissa!\r\n\r\n\r\n* * * * * * * * * *\r\n\r\n\r\nYou are hereby cordially invited to celebrate the 28-year old journey of TKO-äly ry at Kilta-sali, Helsinki (Lapinrinne 1) on the 12th of November.\r\n\r\nThe festivities will begin with a reception in Alina hall at 5 PM (Mannerheimintie 5A), where sparkling wine will served and congratulations for TKO-äly will be heard. Everyone participating in the annual ball is welcome to attend the reception as well.\r\n\r\nDinner will be served at Kilta-sali at 7 PM. During the dinner we will enjoy a three-course meal, sing academic songs and witness speeches and musical performances.\r\n\r\nAfter dinner the party will continue in Alina hall with some music and warm snacks.\r\n\r\nDress code: white tie and academic decorations. The cost of participation is 50€ for members of TKO-äly including the reception, dinner with drinks, the afterparty at Alina hall and transportation between all locations.\r\n\r\nFor an additional 10€ you may participate in the traditional “sillis” Sunday morning brunch including sauna, snacks and some sparkling wine at Sivistys, Leppäsuonkatu 11.\r\n\r\n\r\nDinner menu:\r\n<i>\r\nSmooth and mellow artichoke soup, forest mushroom tartare and bread\r\n* * *\r\n\r\nLamb neck well done, fried polenta with Waldemar cheese and a juniper berry sauce\r\n\r\nOR\r\n\r\nRoasted aubergine with peanut topping and crispy onion, side from fresh green beans, mangetout and courgette\r\n\r\n* * *\r\nKilta's chocolate cake with white chocolate ganache and raspberry\r\n</i>\r\n\r\nSee you at the best party of the year!",
    "deleted": 0,
    "price": "Alkoholillinen TKO-älyn jäsen 50€\r\nAlkoholiton TKO-älyn jäsen 40€\r\n\r\nAlkoholillinen opiskelija 60€\r\nAlkoholiton opiskelija 50€\r\n\r\nAlkoholillinen ei-opiskelija 65€\r\nAlkoholiton ei-opiskelija 55€\r\n\r\nSilliaamiainen 10€"
  },
  {
    "id": 1094,
    "name": "Yritysvierailu: Elisa Appelsiini",
    "user_id": 797,
    "created": "2016-09-07T13:47:10.000Z",
    "starts": "2016-10-03T17:00:00.000Z",
    "registration_starts": "2016-09-27T12:00:00.000Z",
    "registration_ends": "2016-09-30T18:00:00.000Z",
    "cancellation_starts": "2016-09-27T12:00:00.000Z",
    "cancellation_ends": "2016-09-30T18:00:00.000Z",
    "location": "Elisa Appelsiini, Kaarlenkatu 11, Helsinki",
    "category": "Yritysvierailu",
    "description": "Tervetuloa ma 3.10. klo 17:00  kurkkimaan mitä meillä Elisa Appelsiinilla, kalliossa, oikein tapahtuu. Mikä ihmeen Appelsiini ja mitä täällä tehdään. Vierailulla pääset tutustumaan meidän jengiin ja meidän juttuihin. Tarjolla on hyvän ruuan, juoman ja juttujen lisäksi mielenkiintoista tekemistä Appelsiinin jokapäiväisten duunien parissa.\r\n\r\n--\r\n\r\n<b>Note: This event is in Finnish only</b>\r\n\r\nHuomaathan että ilmoittautuminen on sitova. Jos et pääse exculle, etkä ole perunut ilmoittautumistasi, se voi johtaa excukieltoon.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1111,
    "name": "Fuksisitsit / FUKSIEN ILMO",
    "user_id": 1306,
    "created": "2016-09-27T13:17:15.000Z",
    "starts": "2016-10-11T19:00:00.000Z",
    "registration_starts": "2016-09-28T12:00:00.000Z",
    "registration_ends": "2016-10-11T19:00:00.000Z",
    "cancellation_starts": "2016-09-28T12:00:00.000Z",
    "cancellation_ends": "2016-10-07T16:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "TÄMÄ ILMOTTAUTUMINEN ON VAIN FUKSEILLE!\r\nTHIS SIGNUP IS ONLY FOR THE FRESHMEN!\r\n\r\n\r\nSitsit, eli akateemiset pöytäjuhlat, ovat tärkeä osa pohjoismaista yliopistokulttuuria. Lyhyesti sanottuna sitseillä pukeudutaan hienosti, syödään sekä juodaan, ja viimeisimpänä, muttei vähäisimpänä, lauletaan. Nyt on tilaisuutesi olla todistamassa ensimmäisiä sitsisejäsi, joten älä jää paitsi niistä!\r\n\r\nAinakin puolet paikoista varataan fukseille, mutta vanhemmat opiskelijat toivotetaan myös tervetulleiksi näyttämään mallia nuoremmille palleroille.\r\n\r\nJos nyt mietit “miksi”, kysyn “miksi ei”, ja kumoan samalla huonoimmat vastauksesi:\r\n\r\nEn osaa laulaa!\r\n-En minäkään.\r\n\r\nEn omista formaalia asua.\r\n-Hanki sellainen, tarvitset joka tapauksessa.\r\n\r\nEn halua humaltua.\r\n-Ilmottaudu alkoholittomana.\r\n\r\nEn tunne sieltä ketään.\r\n-Sitseillä tutustut.\r\n\r\nSitseillä nähdään!\r\n\r\n---\r\n\r\nSitsit (academic table parties) has an important role in Finnish university culture. In short: we dress up nicely, we eat and drink, and last but not the least, we sing. This is your chance to see it yourself, do not miss it!\r\n\r\nAt least half of the seats are reserved for the freshmen, but obviously we’ll welcome older students to join the sitsit and to show how it’s done.\r\n\r\nNow if your wondering “why, I’ll ask “why not” and refute your worst arguments:\r\n\r\nI can’t sing!\r\n-Me neither.\r\n\r\nI don’t have formal clothes.\r\n-Go get some, you need them anyways.\r\n\r\nI don’t want to get drunk.\r\n-Sign up as non-alcohol.\r\n\r\nI don’t know anyone there.\r\n-You will.\r\n\r\nSee you at the sitsit!",
    "deleted": 0,
    "price": "Alkoholillinen fuksi: 12e\r\nAlkoholillinen auttava fuksi:9e\r\nAlkoholiton fuksi: 10e\r\nAlkoholiton auttava fuksi: 7e"
  },
  {
    "id": 1134,
    "name": "CGI Excu",
    "user_id": 1290,
    "created": "2016-10-27T15:09:35.000Z",
    "starts": "2016-12-08T17:00:00.000Z",
    "registration_starts": "2016-11-17T12:01:00.000Z",
    "registration_ends": "2016-12-02T08:59:00.000Z",
    "cancellation_starts": "2016-11-17T12:01:00.000Z",
    "cancellation_ends": "2016-12-02T08:59:00.000Z",
    "location": "Karvaamokuja 2",
    "category": "Excu",
    "description": "Vuonna 1976 perustettu CGI on maailman 5. ja Suomen 2. suurin riippumaton ICT-palveluja tarjoava yritys. Yhtiön 68 000 asiantuntijaa palvelevat tuhansia asiakkaita maailmanlaajuisesti. Suomessa CGI työllistää yli 3 000 henkilöä 17 paikkakunnalla. Olemme johtava innovatiivisten liiketoiminta- ja IT-ratkaisujen kehittäjä. Autamme asiakkaitamme kehittämään liiketoimintaa digitaalisessa maailmassa – ihmiset ensin, tehokkaasti ja turvallisesti.\r\n \r\nExcussa esitellään muutamia CGI:n kasvualueita: digitaalinen asiakaskokemus, mobiiliosaaminen, tietoturva ja smart cities. Tule kuulemaan mitä CGI:llä tehdään, miten meillä työskennellään ja millaisia tyyppejä meillä on töissä. Tarjolla ruokaa, juomaa ja saunomismahdollisuus!\r\n\r\n---\r\n\r\nThis excu will be held in Finnish.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1163,
    "name": "Matrix ja TKO-äly goes Pikkulaskiainen '17!",
    "user_id": 1080,
    "created": "2017-01-18T16:09:20.000Z",
    "starts": "2017-02-09T12:00:00.000Z",
    "registration_starts": "2017-01-23T12:00:00.000Z",
    "registration_ends": "2017-02-09T12:00:00.000Z",
    "cancellation_starts": "2017-01-23T12:00:00.000Z",
    "cancellation_ends": "2017-01-31T23:59:00.000Z",
    "location": "Suomen Turku",
    "category": "Mäenlasku",
    "description": "In english below.\r\n\r\nAlkuvuoden kohokohta lähestyy taas uhkaavaa vauhtia. Matrixille ja TKO-älylle jo perinteeksi muuttunut Pikkulaskiainen järjestetään tänä vuonna torstaina 9.2.2017 lempeässä Turussa.\r\n\r\nMeidän Pikkulaskiaisemme alkaa legendaarisella bussimatkalla kohti Turkua, ja päättyy siihen seuraavana yönä. Siinä välissä on mahdollista osallistua mäenlaskutapahtumaan, sekä After Ski -approon, jonka avulla pääsemme kiertämään ja tutustumaan Turkuun yhä enemmän ja syvemmin.\r\n\r\nHintaa retkelle tulee 31€, joka sisältää kaiken appro-lipusta jatkopaikkaan ja bussikuljetuksiin. Pelkkää lippua et siis tätä kautta voi ostaa, vaan ostat myös kuljetuksen.\r\n\r\nMukaan mahtuu 50 nopeinta innokasta, riippumatta siitä, kumman järjestön jäsen olet. Nopeus on siis valttia, ei kannata hitailla! Ilmoittautuminen alkaa perjantaina 23.1.2017 klo 12:00. Ilmoittautuminen muuttuu sitovaksi 31.1.2017.\r\n\r\nTässä vielä virallinen aikataulumme:\r\n\r\n12:00 bussikuljetus lähtee Kumpulasta\r\n(Täydentynee myöhemmin)\r\n3:00 bussikuljetus lähtee Turusta\r\n\r\nPidätämme oikeudet muutoksiin.\r\n\r\nLisätietoa itse tapahtumasta: http://pikkulaskiainen.fi/\r\nMuuta kysyttävää? Lähetä viesti osoitteeseen liikuntavastaava@tko-aly.fi.\r\n\r\n----------------\r\n\r\nThe highlight for the beginning year is approaching. As is tradition, TKO-äly is joining Matrix for Pikkulaskiainen on Thursday 9th of February in lovely Turku.\r\n\r\nPikkulaskiainen is an off the hook student event organized annually by the Association of Economics Students in Turku for over two decades already. The day starts with sledging and other fun activities at the Puolala Park, followed by an “After Ski” –pub crawl in downtown Turku. The “Winter is a party” –after parties at the city’s hottest nightclubs culminate Pikkulaskiainen.\r\n\r\nThe fee of 31€ includes a ticket for the pub crawl, admission to the afterparty aswell as transportation to and from Turku. A bus has been arranged to take us there in the morning, and to bring us back after we've given our everything.\r\n\r\nRegistrations are binding after 31.1.2017.\r\n\r\nSchedule for the trip:\r\n12:00 Bus leaves from Kumpula\r\n\r\n3:00 Bus leaves from Turku\r\n\r\nMore information on Pikkulaskiainen: http://pikkulaskiainen.fi/en/\r\nQuestions? liikuntavastaava@tko-aly.fi",
    "deleted": 0,
    "price": "31€"
  },
  {
    "id": 1167,
    "name": "Tein itse ja säästin -sitsit (TKO-äly)",
    "user_id": 1672,
    "created": "2017-01-19T22:17:54.000Z",
    "starts": "2017-02-05T19:00:00.000Z",
    "registration_starts": "2017-01-23T15:00:00.000Z",
    "registration_ends": "2017-02-02T20:12:00.000Z",
    "cancellation_starts": "2017-01-23T15:00:00.000Z",
    "cancellation_ends": "2017-02-02T20:12:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Tämä ilmoittautuminen on TKO-älyn jäsenille \r\nIlmoittautuminen Matrixille ja Intelligenzialle: \r\nhttps://members.tko-aly.fi/calendar_events/view/1168\r\n\r\n\r\nKuka meistä nyt ei olisi opiskelijabudjetilla päässyt venyttämään senttiä joskus aivan viimeiseen asti. Tapahtumat ovat välillä budjetille rankkoja, mutta tällä kertaa sitseille ei ainakaan pukeutumisesta tarvitse kauaa etukäteen murehtia tai turhaan ottaa paineita siitä onko kauluspaita varmasti puhtaana. Nopeastihan tuon nyt itse väkertää. \r\n\r\n\r\nMITÄ: Sitsit\r\nPUKUKOODI: Tein itse ja säästin\r\nMISSÄ: Mannerheimintie 5 A, 3. floor\r\nMILLOIN: 5.2. 19.00\r\nHINTA: 15e (alkoholiton 13e)\r\n\r\n---\r\n\r\nBalancing your personal budget with student allowance can be tricky and events are always so expensive. At least at these sitsit you don't have to worry about your appearance or whether or not you remembered to wash your dress shirt in time. Making one yourself can't be that difficult, right. \r\n\r\nTLDR\r\nWHAT: Sitsit\r\nDRESS CODE: DIY\r\nWHERE: Mannerheimintie 5 A, 3. floor\r\nWHEN: 5th of February 7PM\r\nPRICE: 15e (non-alcoholic: 13e)",
    "deleted": 0,
    "price": "Alkoholillinen 15e\r\nAlkoholiton 13e"
  },
  {
    "id": 1155,
    "name": "Nitor Excu",
    "user_id": 1290,
    "created": "2017-01-03T10:20:30.000Z",
    "starts": "2017-01-31T17:00:00.000Z",
    "registration_starts": "2017-01-25T12:01:00.000Z",
    "registration_ends": "2017-01-31T15:00:00.000Z",
    "cancellation_starts": "2017-01-25T12:01:00.000Z",
    "cancellation_ends": "2017-01-29T18:57:00.000Z",
    "location": "Aleksanterinkatu 44 A 8",
    "category": "Excu",
    "description": "Olette lämpimästi tervetulleita Nitorin exculle tiistaina 31.1.2017 klo 17:00 -> 21:00.\r\n\r\nNitor on digitaalinen insinööritoimisto, jossa me alamme aikuiset ammattilaiset, autamme asiakkaitamme menestymään. Olemme 95 hengen vahvuinen konsulttitalo, jossa löytyy tilaa kaikenlaisille huippulupauksille. Autamme asiakkaitamme kaikessa UX:n ja backin välillä. Meillä on varaa valikoida asiakkaitamme, ja siksi Nitorilla pääsee tekemään perin meheviä juttuja ja oppimaan rutkasti uutta kokeneilta kollegoilta.\r\n\r\nVirallisen ohjelman kesto on noin kaksi tuntia, jonka jälkeen voitte nauttia pöydän antimista ja kylmästä juotavasta (juomaa voi toki nauttia jo esitysten aikana ;D).\r\n\r\nOhjelmassa tiistaina on:\r\n\r\nPetteri Tuomimaa esittelee Nitoria\r\nMarkku Laakson polku yliopistolta Nitorille\r\nJuha Itkonen: \"Miten ketteryys rakentaa laatua samalla kun myös nopeus, tuottavuus ja hyvinvointi paranevat?\", ja Joel Kaasiselta + Juhalta pieni toiminnallinen harjoitus aiheeseen liittyen\r\nPasi Niemi esittelee AWS-aiheisia oppeja Las Vegasista: Lessons Learned from re:Invent GameDay\r\n\r\nNitoriin voit tutustua etukäteen osoitteessa https://www.nitor.fi  ja seurailla Instagramissa, Twitterissä ja Facebookissa tunnuksella ”nitorcreations”.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1158,
    "name": "Tuxera Excu",
    "user_id": 1306,
    "created": "2017-01-13T09:50:20.000Z",
    "starts": "2017-03-21T17:00:00.000Z",
    "registration_starts": "2017-02-16T12:00:00.000Z",
    "registration_ends": "2017-03-17T18:00:00.000Z",
    "cancellation_starts": "2017-02-16T12:00:00.000Z",
    "cancellation_ends": "2017-03-17T18:00:00.000Z",
    "location": "Tuxera, Westendintie 1 (A-door), Espoo",
    "category": "Excu",
    "description": "Join our Excu at Tuxera!\r\n\r\nTuxera is pleased to invite TKO-äly members for an Excu on 21.3.2017 at 17:00 onwards. Come and listen to what Tuxera is about, how they write code, and career stories from some of Tuxera’s  employees. During the evening, you will get a rare opportunity to join an exclusive visit at the lab. Tuxera will also talk about their summer and part-time working opportunities for students interested for example in Linux kernel, file systems, as well as storage and networking technologies. Food, drinks, bomberman and table tennis will be on the house! You can also take advantage of our sauna and pool facilities if you wish. In that case please remember to bring your bathing suit and towel.\r\n\r\nTuxera is looking forward to meeting you soon!\r\n\r\nAlso: signup to the queue even if the excu is full, it might be possible to have even more people joining!",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1191,
    "name": "Helsinginkadun appro '17",
    "user_id": 1080,
    "created": "2017-02-20T12:24:27.000Z",
    "starts": "2017-04-12T16:00:00.000Z",
    "registration_starts": "2017-02-27T12:00:00.000Z",
    "registration_ends": "2017-04-09T23:59:00.000Z",
    "cancellation_starts": "2017-02-27T12:00:00.000Z",
    "cancellation_ends": "2017-04-09T23:59:00.000Z",
    "location": "Helsinginkatu, Kallio",
    "category": "Yhteistoiminta",
    "description": "Helsinginkadun Appro, tuo opiskelijatapahtumista lähes pelätyin, jolloin suurin osa Helsingin haalarikansasta nousee ulos koloistaan ja pakkautuu halvoista tuopeista ja boheemista menosta tunnetulle maantieteelliselle alueelle, tulee taas JÄLLEEN KERRAN!\r\n\r\nTKO-äly on tänä vuonna hankkinut 60 lippua ja siis approilemaan ollaan menossa, jos ei käynyt ilmi.\r\n\r\nEtkö tiedä miten appro toimii? Osallistumismaksun hinnalla saat suorituskortin, osallistuvista ravitsemusliikkeistä alennushintaisia alkoholijuomia ja rannekkeen, jolla pääsee jatkoille. Vedä siis haalarit jalkaan ja liity hauskanpitoon!\r\n\r\nHuomaathan, että ilmoittautumisajan päätyttyä sitoudut maksamaan lipun.\r\n\r\nP.S. ainejärjestön epävirallinen ennätys Tohtorisuoritukseen (20 merkintää) on noin 22 minuuttia.\r\n\r\n-----------------------\r\n\r\nHelsinginkadun Appro, perhaps one the most known of all the pub crawls is here again and TKO-äly has acquired 60 tickets! You know you want to!\r\n\r\nWhat's a pub crawl? For the price of admission you get a \"report card\", discounts for drinks in participating bars and a ticket to the afterparty, so put on your overalls and join the fun!\r\n\r\nPlease note that you agree to pay for the ticket after the registration has closed.\r\n\r\nP.S. the unofficial record for a doctoral degree in this event is roughly 22 minutes.",
    "deleted": 0,
    "price": "13€"
  },
  {
    "id": 1185,
    "name": "Yritysvierailu: Reaktor",
    "user_id": 1175,
    "created": "2017-02-15T20:09:54.000Z",
    "starts": "2017-03-29T17:00:00.000Z",
    "registration_starts": "2017-03-12T15:00:00.000Z",
    "registration_ends": "2017-03-22T23:59:00.000Z",
    "cancellation_starts": "2017-03-12T15:00:00.000Z",
    "cancellation_ends": "2017-03-22T23:59:00.000Z",
    "location": "Mannerheimintie 2",
    "category": "Excu",
    "description": "<b>Kevään Reaktor-excu on täällä!</b>\r\n\r\nLämpimästi tervetuloa Reaktor-exculle! \r\n\r\nExculla haluamme tutustuttaa sinut Reaktorin maailmaan. Esko tulee verhottamaan Clojuren salaisuuksia, pääset kuulemaan kesätyökokemuksista ja jännittävistä asiakasprojekteista, joiden avulla muutetaan maailmaa. Jatkamme keskusteluja ruuan, juoman ja saunan merkeissä (et tarvitse mukaan omaa pyyhettä ja hiustenkuivaajat jne löytyy).\r\n\r\nReaktor on kasvava ja kansainvälistyvä erinomaisia digitaalisia palveluita tekevä konsulttiyritys. Meillä on töissä noin 400 huippuasiantuntijaa eli huippista Helsingissä, New Yorkissa, Tokiossa ja Amsterdamissa. Asiakkaamme vaihtelevat aina start-up -yrityksistä suuriin kansainvälisiin yrityksiin kuten Finnairiin ja HBO:hon ja alustat mobiilista suuriin monen näytön kosketusseiniin.Täältä voit tutustua lisää asiakasprojekteihimme https://reaktor.com/work/\r\n\r\n\r\nTervetuloa siis juttelemaan ja viettämään rentoa iltaa Reaktorille! \r\n\r\n<b>Käytännön infoa:</b>\r\n\r\nExcu järjestetään suomeksi. Excu alkaa 29.3. kello 17, sisäänkäynti Mannerheimintie 2, 6 krs. 16:45 alkaen. Lisäinfoa Reaktorista, asiakkaistamme ja työpaikoistamme löydät osoitteesta reaktor.com\r\n\r\n_____________________________________________\r\n\r\n<b>Excursion only in Finnish</b>",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1186,
    "name": "Reaktor Pair Programming Competition in Code Golf",
    "user_id": 1175,
    "created": "2017-02-15T20:14:11.000Z",
    "starts": "2017-04-08T13:37:00.000Z",
    "registration_starts": "2017-03-28T12:00:00.000Z",
    "registration_ends": "2017-04-05T23:59:00.000Z",
    "cancellation_starts": "2017-03-28T12:00:00.000Z",
    "cancellation_ends": "2017-04-02T23:59:00.000Z",
    "location": "Mannerheimintie 2",
    "category": "Hackathon",
    "description": "<b>Rules for the competition</b>\r\n\r\nReaktor Pair Programming Competition tulee taas. Aiheena on jälleen Code Golf! Code Golfissa kilpailijoiden tulee toteuttaa annettuja tehtäviä mahdollisimman pienellä määrällä koodia. Vähiten merkkejä sisältävän ratkaisun tehnyt joukkue voittaa 'reiän'. Tapahtuma järjestetään Reaktorin keskustan toimistolla.\r\n\r\nKilpailuun ilmottaudutaan pareittan. Kilpailupaikalla ei ole laitteita kilpailijoille, vaan parilta edellytetään vähintään yksi laite, mieluiten myös varalaite.\r\n\r\n---\r\n\r\nReaktor Pair Programming Competition is here again. We will be Code Golfing once again! In Code Golf the contestants are creating solutions to given tasks with as little code as possible. The team to have fewest amount of characters in their solution wins the 'hole'. The event will take place in Reaktor's office in Mannerheimintie 2.\r\n\r\nContestants sign up to the competition as teams with the form below. We do not have devices for you, so team should bring at least one computer, but preferably one spare device.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1206,
    "name": "Uuden laulukirjamme läpilaulajaiset",
    "user_id": 743,
    "created": "2017-03-31T18:09:14.000Z",
    "starts": "2017-04-07T17:00:00.000Z",
    "registration_starts": "2017-03-31T19:09:00.000Z",
    "registration_ends": "2017-04-07T17:00:00.000Z",
    "cancellation_starts": "2017-03-31T19:09:00.000Z",
    "cancellation_ends": "2017-04-07T17:00:00.000Z",
    "location": "Christina Regina, Domus Gaudium, Leppäsuonkatu 11",
    "category": "Külttüüri-ilta",
    "description": "INFORMATION AVAILABLE IN ENGLISH BELOW!\r\n \r\nSe päivä, mitä me kaikki olemme pelänneet, on täällä. Jo ennen universumin lämpökuolemaa on yksi ikuisuusprojekti saatu päätökseen ja tekiksen laulukirja valmistuu vuosien jälkeen. Mutta jotta saisimme tietää mistä opus on tehty, on se tutkittava tarkoin. Ja mikäpä parempi tapa laulukirjan tutkailuun kuin läpilaulanta!\r\n \r\nAloitamme kivasti viideltä kirjan ensimmäisten ja parhaiden laulujen mailta, mutta toki myöhemminkin voi saapua paikalle hoilottamaan kun edellisistä jo ääni vähitellen jättää, olettaen tietysti aitoa eläytymistä jota sitsilaulut vaativat. Rakas ainejärjestömme hoitaa paikalle joitain tarjoiluja, mutta ottakaa ihmeessä oma muumilimu tai vastaava mukaan!\r\n \r\nSisältäen esimerkiksi:\r\n<ul>\r\n<li>Dodo Sorsa</li>\r\n<li>Krimin Kriisi</li>\r\n<li>Sandstorm</li>\r\n<li>Rakenteisiin asti</li>\r\n<li>Ja paljon muuta!</li>\r\n</ul> \r\n\r\nKlusterille pääsee sisään Christina Reginan ovikelloa soittamalla, tai soittamalla Juliukselle (+358 415250768).\r\n------------------------------------------------\r\n \r\n'Ello!\r\n \r\nThe day the Finnish speaking folk have both awaited and dreaded is soon upon us. The songbook of TKO-äly, many years in the making, will soon raise from it's formerly presumed eternal slumber and a new version will be made available for purchase. However, the quality assurance department demands us to sing through the entire thing in order to make sure the book is any good, so that's what we are going to do!\r\n \r\nAs is to be assumed, we will be starting from the beginning of the book where the first and best songs reside, but you are of course welcome to join the choir at a later point, when those from the start are already losing their voice. Our beloved student organization will provide a certain level of \"catering\", but it would be recommended to take your own Muumi-soda (or similar) with you!\r\n \r\nAs a side note, many (read: most) of the songs will be in Finnish as per sitsi protocol, but that should not be much of a hassle, right?\r\n \r\nFeaturing, but not limited to:\r\n<ul>\r\n<li>Bohemian Rhapsody</li>\r\n<li>Pokémon theme</li>\r\n<li>Sandstorm</li>\r\n<li>All Star</li>\r\n<li>And many more!</li>\r\n</ul>\r\n\r\nYou can get in to Klusteri by pressing the Christina Regina doorbell at the door, or by calling Julius (+358 415250768).",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1212,
    "name": "Vappusitsit (TKO-äly:n ilmo)",
    "user_id": 1340,
    "created": "2017-04-09T21:29:16.000Z",
    "starts": "2017-04-29T18:00:00.000Z",
    "registration_starts": "2017-04-11T12:34:00.000Z",
    "registration_ends": "2017-04-25T18:00:00.000Z",
    "cancellation_starts": "2017-04-11T12:34:00.000Z",
    "cancellation_ends": "2017-04-25T18:00:00.000Z",
    "location": "Pirunkirkon juhlasali, Suomenlinna",
    "category": "Sitsit",
    "description": "Sitsit 29.4. Vappu 30.4. Sattumaako? Tuskin.\r\n\r\nEli vappu tulee, oletko valmis?! Haalarit pääsee kiskomaan ylleen taas jo 29.4. kun TKO-äly järjestää perinteiset vappusitsit tällä kertaa Suomenlinnassa! Tule siis kanssamme juhlistamaan tätä hulvatonta työ väen juhlaa! Pukeudu haalareihin ja vapun henkeen sopivaan tilpehööriin!\r\n\r\nTällä kertaa on myös mahdollista tilata TKO-älyn uusi laulukirja suoraan pöytään odottelemaan. Kirja maksaa 7€.\r\n\r\nHUOM! Suomenlinnaan kuljetaan Helsingin sisäisellä HSL -lipulla.\r\n\r\nMITÄ: Vappusitsit\r\nMISSÄ: Pirunkirkon juhlatila, Suomenlinna C 28\r\nMILLOIN: 29.4.2016 18.00\r\nMIKSI: Vappu!\r\n\r\n---\r\n\r\nSitsis 29.4. Vappu 30.4. Coincidende? I think not.\r\n\r\nVappu is coming, are you ready?! Now you have the chance to put on your overalls already on 29.4. when TKO-äly are having hilarious vappusitsis in Suomenlinna. So come celebrate the Workers' Day with us! Put on your overalls and some vappu decorations, and you're ready to go!\r\n\r\nThis time it is possible to pre-order TKO-äly's new songbook directly to the table. Songbook costs 7€.\r\n\r\nNote that the ferry trip to Suomenlinna is a normal public transportation and requires a Helsinki region public transportation ticket.\r\n\r\nWHAT: Vappusitsis\r\nWHERE: Pirunkirkon juhlatila, Suomenlinna C 28\r\nWHEN: 29.4.2016 18.00\r\nWHY: Vappu!",
    "deleted": 0,
    "price": "alkoholilla 16e\r\nalkoholiton 14e"
  },
  {
    "id": 1211,
    "name": "Smartly Excu",
    "user_id": 1290,
    "created": "2017-04-05T14:50:35.000Z",
    "starts": "2017-05-03T17:00:00.000Z",
    "registration_starts": "2017-04-19T12:01:00.000Z",
    "registration_ends": "2017-04-26T09:59:00.000Z",
    "cancellation_starts": "2017-04-19T12:01:00.000Z",
    "cancellation_ends": "2017-04-26T09:59:00.000Z",
    "location": "Smartly, Itämerenkatu 1",
    "category": "Excu",
    "description": "Welcome to the Smartly.io x TKO-äly excu!\r\n\r\nWe’re excited to host you at our office on May 3rd! We’d like to get to know you better and give you a glimpse of what it’s like to work in our team and what technical challenges our developers get to work on. Food and drinks will be served. See you! :)\r\n\r\n——\r\n\r\nSmartly.io is a humble, hungry team of 130+, working at the leading edge of online customer acquisition and retention. We build a SaaS tool to automate and optimize online marketing for the largest online businesses globally, including eBay, Skyscanner and JustFab. \r\n\r\nSmartly.io was founded in Helsinki back in 2013 by Kristo Ovaska and Tuomo Riekki. Today, we’re a quickly growing growth company with HQ in Helsinki, and footholds in NYC, San Francisco, Singapore and Berlin. We’re looking for more talents who want to maximize their learning. Find out more at https://www.smartly.io/careers",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1226,
    "name": "ATK-YTR",
    "user_id": 1447,
    "created": "2017-05-22T13:34:43.000Z",
    "starts": "2017-07-22T17:30:00.000Z",
    "registration_starts": "2017-05-24T12:00:00.000Z",
    "registration_ends": "2017-06-13T23:59:00.000Z",
    "cancellation_starts": "2017-05-24T12:00:00.000Z",
    "cancellation_ends": "2017-06-13T23:59:00.000Z",
    "location": "Länsiterminaali",
    "category": "Risteily",
    "description": "Kesä, eikä mitään tekemistä?\r\n\r\nTietotekniikan liitto TiToL ry järjestää jäsenjärjestöjensä jäsenille aivan uudenlaisen tapahtuman eli ATK-Yhteistoimintaristeilyn kesälle. Risteily kokoaa IT-alan opiskelijoita ympäri suomea samaan paattiin, viihtyvyys on siis taattu!\r\n\r\nRistely lähtee Helsingin länsisatamasta 18.30 Tallink Silja Linen laivalla kohti etelänaapuriamme Viroa. Yö vietetään satamassa ja aamulla on MAHDOLLISUUS käydä maissa 8.00-11.00 välillä suorittamassa haluamansalaisia ostoksia muutaman tunnin ajan. Laivasta ei kuitenkaan ole pakko poistua, vaan edellisen illan buffettia voi hyvin sulatella pidempäänkin. Laiva saapuu takaisin Suomeen 15.00. sunnuntaina.\r\n\r\nRisteilyn hinta sisältää 10,50€ arvoisen ruokalipukkeen käytettäväksi laivan ravintoloissa.\r\n\r\nTKO-äly pyrkii toteuttamaan hyttijärjestelyt osallistujien toiveiden mukaan.\r\n\r\nMITÄ: ATK-Yhteistoimintaristeily\r\nMISSÄ: Helsinki-Tallinna-Helsinki\r\nMILLOIN: 22.-23.7.\r\nMIKSI: Yhteistoimintaa!\r\n\r\n-------\r\n\r\nTiTol ry, union for information technology students, is arranging a brand new event for its members. Here comes ATK-YTR - a cruise from Helsinki to Tallinn including IT students from all over Finland.\r\n\r\n\r\nThe cruise sets sail from West terminal on Saturday 22nd of July at 6.30pm. You have a possibility to visit Tallinn shortly on Sunday from 8am till 11am but you can also stay in the ship and get some much needed rest. We'll be back in Helsinki on Sunday 23rd at 3pm.\r\n\r\nTKO-äly will try to arrange cabins according to all wishes.\r\n\r\nWHAT: ATK-YTR cruise\r\nWHERE: The baltic sea, from Helsinki to Tallinn and back\r\nWHEN: 22.-23.7.\r\nWHAT DOES IT COST: 18€ (includes 10,50€ to be used on food on the ship)\r\nWHY: Because IT students from all over Finland that's why!",
    "deleted": 0,
    "price": "18€"
  },
  {
    "id": 1204,
    "name": "29. Vuosijuhlat",
    "user_id": 152,
    "created": "2017-03-28T12:52:03.000Z",
    "starts": "2017-11-11T18:00:00.000Z",
    "registration_starts": "2017-09-30T12:00:00.000Z",
    "registration_ends": "2017-10-27T12:00:00.000Z",
    "cancellation_starts": "2017-09-30T12:00:00.000Z",
    "cancellation_ends": "2017-10-27T12:00:00.000Z",
    "location": "Ravintola Loiste",
    "category": "Vuosijuhla",
    "description": "Meillä on ilo kutsua teidät TKO-äly ry:n 29. vuosijuhlille lauantaina 11.11.2017.\r\n\r\nAloitamme juhlallisuudet tervehdyksillä ja onnitteluilla klo 16:00 Uudella ylioppilastalolla Alina-Salissa, osoitteessa Mannerheimintie 5 A. Tämän jälkeen siirrymme juhlapaikalle ravintola Loisteeseen, aivan kivenheiton päähän, jossa itse juhlat alkavat klo 18:00. Illallisosuuden jälkeen siirrymme jatkoille takaisin Uudelle ylioppilastalolle. Sunnuntaiaamuna halukkaille on tarjolla silliaamiainen Sauna2 Siltasaaressa, Paasivuorenkatu 3.\r\n\r\nMenu:\r\n\r\nJokirapusalaattia ja verigreippivinagrettia\r\n***\r\nRosepaistettua härän sisäfileetä, tryffeli-pekoniperunaa, madeirakastiketta\r\n***\r\nLimettikakkua ja mango-minttusalaattia\r\n\r\nTai\r\n\r\nBuffala mozzarellaa ja pisaratomaattisalsaa\r\n***\r\nTäytetty portobello, ohrattoa ja paahdettua paprikakastiketta.\r\n***\r\nLimettikakkua ja mango-minttusalaattia\r\n\r\nIllallinen ja jatkot yöpaloineen maksavat 65 euroa (alkoholiton 55e), ja TKO-älyn jäsenille 60 euroa (alkoholiton 50). Silliaamiainen kustantaa 15 euroa. Pukukoodina frakki tai tumma puku, sekä akateemiset kunniamerkit. Lisätietoa löytyy osoitteesta vuosijuhlamestari@tko-aly.fi.\r\n\r\nToivotamme Teidät lämpimästi tervetulleiksi!\r\n\r\nParhain terveisin,\r\n\r\nvuosijuhlatoimikunta\r\nTKO-äly ry\r\n\r\n------------------\r\n\r\nYou are cordially invited to the 29th anniversary banquet of TKO-äly on Saturday, November 11th.\r\n\r\nWe will begin the festivities at 16:00 with greetings and congratulations held in Alina Hall at the New Student House (Alina-sali, Uusi ylioppilastalo, Mannerheimintie 5). After this we'll move to the banquet hall, restaurant Loiste which is practically next door, after which we'll return to the New Student House for the afterparty. On Sunday a traditional sillis will be held at Sauna2 Siltasaari (Paasivuorenkatu 3).\r\n\r\nMenu for the dinner is as follows:\r\n\r\nCrayfish salad with a pink grapefruit vinaigrette\r\n***\r\nRose-fried ox fillet, trouffled bacon potatoes with madeira sauce\r\n***\r\nLime cake with mango-peppermint salad\r\n\r\nOR\r\n\r\nBuffala mozzarella with tomato salsa\r\n***\r\nFilled portobello with barley and toasted paprika sauce\r\n***\r\nLime cake with mango-peppermint salad\r\n\r\nPrice for the banquet including the afterparty and late night snacks costs 65 euros (55 for the non-alcoholic menu) and for members of TKO-äly, the price is 60 euros (50 for non-alcoholic menu). The traditional sillis costs 15 euros.\r\n\r\nDress code: formal with academic badges. Contact vuosijuhlamestari@tko-aly.fi for more information.\r\n\r\nWelcome to one and all!",
    "deleted": 0,
    "price": "Alkoholillinen: 65e (Jäsen 60e)\r\nAlkoholiton 55e (Jäsen 50e)"
  },
  {
    "id": 1362,
    "name": "Elisa Case Night: Service Design",
    "user_id": 1685,
    "created": "2018-02-28T09:51:49.000Z",
    "starts": "2018-03-27T17:00:00.000Z",
    "registration_starts": "2018-03-19T12:00:00.000Z",
    "registration_ends": "2018-03-23T18:00:00.000Z",
    "cancellation_starts": "2018-03-19T12:00:00.000Z",
    "cancellation_ends": "2018-03-23T18:00:00.000Z",
    "location": "Elisa, Ratavartijankatu 5, 00520 Helsinki",
    "category": "Yritysvierailu",
    "description": "Event is in English.\r\n\r\nAre you curious about service design? Ever wondered what design systems are good for? Does service design eventually differ that much from product design?\r\n\r\nWhat? Elisa welcomes TKO-äly students to Elisa’s HQ in Pasila to get behind the scenes with what service design means in practice in a big telco company. Our design professionals, who are among the very best in their field, are eager to spend an evening with you talking about service design in all different aspects. The evening will consist of a variety of shorter speeches, presentations of real cases, interactive discussion and of course the time and opportunity to network and mingle.\r\n\r\nWhen? Tuesday 27th of March at 17:00-19:00.\r\n\r\nWhere? Elisa HQ in Pasila, Ratavartijankatu 5.\r\n\r\nWhat else? You don’t need to bring anything but your own, curious self with you to the event. We don’t have a dress code at Elisa but we appreciate if you wear something. If you’re having trouble finding your way there or are late, you can call or message Emilie Sohlström at 0505068025.\r\n\r\n - - - - - - - -\r\n\r\nCase Nights are TKO-älys new format for traditional Excursions. In Case Nights there is one certain theme to tackle and learn more of with the guidance of our partners professionals in highly interactive way. Naturally there will be something to eat and drink.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1349,
    "name": "Bussisitsit",
    "user_id": 1854,
    "created": "2018-02-10T20:39:03.000Z",
    "starts": "2018-03-22T17:30:00.000Z",
    "registration_starts": "2018-03-05T15:00:00.000Z",
    "registration_ends": "2018-03-20T15:00:00.000Z",
    "cancellation_starts": "2018-03-05T15:00:00.000Z",
    "cancellation_ends": "2018-03-20T15:00:00.000Z",
    "location": "Leppäsuonkatu 11 / linja-auto",
    "category": "Sitsit",
    "description": "(English below)\r\n\r\nTKO-älyllä ei ole tarpeeksi Alina-vuoroja. Juhlavuosi tarvitsee tapahtumia. Tilapulan vuoksi kokeilemme käykö Alinan korvikkeeksi tilausbussi, toisin sanoen siis Bussisitsit ovat tulossa.\r\n\r\nMatkareitti on seuraava:\r\n\r\n1. Leppäsuonkatu 11\r\n2. Mysteeritaukopaikka\r\n3. Leppäsuonkatu 11.\r\n\r\nSitsien hintaan kuuluu ruoat, alkumalja, shotti ja kahviavec. Huom, ei siis viinikaatoja! Bussiin saa ja kannattaa napata omia juomia mukaan, ei kuitenkaan punaviiniä.\r\n\r\nIlmoittautuminen alkaa maanantaina 5.3. kello 15:00 ja muuttuu sitovaksi 20.3. Tätä tapahtumaa et halua missata!\r\n\r\nMitä: Bussisitsit\r\nMilloin: Torstaina 22.3. klo 17:30-22\r\nMistä: Leppäsuonkatu 11\r\nMinne: Leppäsuonkatu 11\r\nDresscode: Haalarit ja turvavyöt\r\n\r\n________________________________\r\n\r\nWe all know this year is particularly important for TKO-äly as our noble organization turns 30. This year calls for even more events than usual, but we've quickly run out of reservations for Alina. To combat this urgent lack of sitsispace we're testing out different possibilities. This time we invite you to join us for sitsit in a bus!\r\n\r\nThe route is as follows:\r\n1. Leppäsuonkatu 11\r\n2. Mystery stop\r\n3. Leppäsuonkatu 11\r\n\r\nThe price of the sitsit includes a three-course meal, apetizers, a shot and a coffee avec. NOTE! There will be no pours of wine. You will likely want to bring your own beverages, but steer away from red wine and other staining drinks.\r\n\r\nRegistration opens on Monday 5.3. 15:00 and is binding from 20.3. onwards. You will not want to miss this event!\r\n\r\nWhat? Sitsit on a bus\r\nWhen? Thursday 22.3. 17:30 - 22ish\r\nFrom where? Leppäsuonkatu 11\r\nTo where? Leppäsuonkatu 11\r\nDresscode? Overalls and a seatbelt",
    "deleted": 0,
    "price": "Alcoholic: 14€\r\nAlcoholfree: 13€"
  },
  {
    "id": 1372,
    "name": "Pääsiäissitsit (Tekiksen ilmo)",
    "user_id": 1537,
    "created": "2018-03-12T16:38:09.000Z",
    "starts": "2018-04-01T18:00:00.000Z",
    "registration_starts": "2018-03-16T12:00:00.000Z",
    "registration_ends": "2018-03-29T12:00:00.000Z",
    "cancellation_starts": "2018-03-16T12:00:00.000Z",
    "cancellation_ends": "2018-03-31T18:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Tervetuloa Moodin, Matrixin ja TKO-älyn yhteisille pääsiäissitseille! Nämä sitsit eivät ole mitkään tavalliset virpojaiset vaan tarjolla on pääsiäisen parasta hupia. Saavu siis paikalle trullina tai pääsiäispupuna, heiluta pajunoksaa ja toivo, että virvontaonni suosii. Perinteisen sitsauksen lisäksi illan aikana on hauskaa pääsiäisohjelmaa, johon jokainen voi osallistua!\r\n\r\nLisää infoa tapahtuman facebook sivulta: https://www.facebook.com/events/418534551931086/\r\n------\r\n\r\nWelcome to the Easter sitsit organized by Moodi, Matrix and TKO-äly. These sitsit aren't your regular Easter fasting but the most fun one can have during the Easter break. Arrive dressed up as a mean witch or the cutest Easter bunny you’ve ever seen, and hope that the Easter luck helps you find many chocolate Easter eggs. Along the regular sitsit schedule we also have other fun Easter related activities!\r\n\r\nMore information on the facebook event found here: https://www.facebook.com/events/418534551931086/\r\n",
    "deleted": 0,
    "price": "15e"
  },
  {
    "id": 1365,
    "name": " Reaktor Pair Programming Competition in Code Golf",
    "user_id": 1080,
    "created": "2018-03-06T16:38:54.000Z",
    "starts": "2018-03-31T13:37:00.000Z",
    "registration_starts": "2018-03-22T13:37:00.000Z",
    "registration_ends": "2018-03-28T23:59:00.000Z",
    "cancellation_starts": "2018-03-22T13:37:00.000Z",
    "cancellation_ends": "2018-03-27T23:59:00.000Z",
    "location": "Yliopistonkatu 4",
    "category": "Hackathon",
    "description": "Reaktor Pair Programming Competition tulee taas. Aiheena on jälleen Code Golf! Code Golfissa kilpailijoiden tulee toteuttaa annettuja tehtäviä mahdollisimman pienellä määrällä koodia. Vähiten merkkejä sisältävän ratkaisun tehnyt joukkue voittaa 'reiän'. Tapahtuma järjestetään Reaktorin keskustan toimistolla.\r\n\r\nKilpailupaikalla ei ole laitteita kilpailijoille, vaan parilta edellytetään vähintään yksi laite, mieluiten myös varalaite.\r\n\r\nOsallistumisesta saa yhden opintopisteen.\r\n\r\nAikataulua ja hyväksyttyjen kielten listausta alempana.\r\n\r\n****\r\n\r\nReaktor Pair Programming Competition is here again. We will be Code Golfing once again! In Code Golf the contestants are creating solutions to given tasks with as little code as possible. The team to have fewest amount of characters in their solution wins the 'hole'. The event will take place in Reaktor's office in Yliopistonkatu 4.\r\n\r\nWe do not have devices for you, so team should bring at least one computer, but preferably one spare device.\r\n\r\nParticipants receive one study credit for the event.\r\n\r\n****\r\n\r\nTimetable (preliminary)\r\n13:37 — hanging around, something small to eat\r\n14:00 — rules, warm up exercise, competition\r\n16:00 — small break\r\n18:00 — end of coding, prizes, hanging around, food, drinks, sauna, go through some interesting solutions\r\n\r\nApproved languages: Java, Clojure, Scala, Kotlin, Python, Ruby, JavaScript (Node or Browser), bash, Perl, C, C++, D, Rust, Haskell, OCaml, Swift, Lua\r\n\r\nIf your prefered language is missing, contact ville-veikko.saari(at)helsinki or use the form in the registration.\r\n\r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1379,
    "name": "Vabusits (TKO-älyn ilmo)",
    "user_id": 1537,
    "created": "2018-03-20T17:07:15.000Z",
    "starts": "2018-04-29T18:00:00.000Z",
    "registration_starts": "2018-04-10T12:00:00.000Z",
    "registration_ends": "2018-04-27T12:00:00.000Z",
    "cancellation_starts": "2018-04-10T12:00:00.000Z",
    "cancellation_ends": "2018-04-27T12:00:00.000Z",
    "location": "Euphoria, Sörnäisten Rantatie 33C",
    "category": "Sitsit",
    "description": "Uijjuma, parasta hauskaa taas tarjolla.\r\n\r\nHaalarit tai muuta vappuisaa päälle ja Sörkkään euphoriaan juhlimaan tätä työ väen juhlaa!\r\n\r\nMITÄ: Vappusitsit\r\nMISSÄ: Euphoria\r\nMILLOIN: 29.4.2018 18.00\r\nMIKSI: Miksi ei?!\r\n\r\nSitsien jälkeen lämpiää vappusauna, joka on ahdas ja josta tulee poistua klo 02.30 mennessä. Oma pyyhe mukaan!\r\n\r\n--------\r\n\r\nIt's time to put on your coveralls and celebrate mayday with a table party.\r\n\r\nWHAT: MayDay -sitsis\r\nWHERE: Euphoria\r\nWHEN: 29.4.2018 18.00\r\nWHY: WHY NOT?!\r\n\r\nIn Finland every party is a sauna party (this time sauna is pretty small, prepare to feel cramped), bring your own towel",
    "deleted": 0,
    "price": "17€"
  },
  {
    "id": 1386,
    "name": "AATU 2018 (tekiksen ilmo)",
    "user_id": 1447,
    "created": "2018-03-28T19:09:25.000Z",
    "starts": "2018-05-16T12:00:00.000Z",
    "registration_starts": "2018-04-16T12:00:00.000Z",
    "registration_ends": "2018-05-13T23:55:00.000Z",
    "cancellation_starts": "2018-04-16T12:00:00.000Z",
    "cancellation_ends": "2018-05-13T23:55:00.000Z",
    "location": "Turku",
    "category": "Appro",
    "description": "IN ENGLISH BELOW\r\n\r\nMatrix ja TKO-äly jatkavat yhteisten Turun reissujen perinnettä lähtemällä yhdessä AATUun keskiviikkona 16.5.\r\n\r\nAATU, eli Akateeminen Aurajokilaivuritutkinto on Akateeminen Aurajokilaivuriyhdistys ry:n järjestämä appromainen tapahtuma, jossa\r\nkierretään Aurajoen ravintolalaivoja kiireettömässä ilmapiirissä.\r\n\r\nAATU-reissu alkaa legendaarisella bussimatkalla kohti\r\nTurkua. Sen jälkeen suoritetaan itse tutkinto, käydään AATUn jatkoilla, ja\r\nlopuksi palataan yhdessä bussilla Helsinkiin.\r\n\r\nHintaa retkelle noin 30€ (tarkentuu myöhemmin), joka sisältää kaiken appro-lipusta\r\njatkopaikkaan ja bussikuljetuksiin. Pelkkää lippua et siis tätä kautta\r\nvoi ostaa, vaan ostat myös kuljetuksen.\r\n\r\nMukaan mahtuu yhteensä 50 nopeinta innokasta, kummastakin järjestöstä 25. Nopeus on siis valttia, ei kannata hitailla!\r\nIlmoittautuminen alkaa maanantaina 16.4.2018 klo 12:00.\r\nIlmoittautuminen muuttuu sitovaksi sunnuntaina 13.5.2018 klo 23:59.\r\n\r\nTässä vielä virallinen aikataulumme:\r\n12:00 bussikuljetus lähtee Kumpulasta\r\n3:00 bussikuljetus lähtee Turusta\r\n\r\nPidätämme oikeudet muutoksiin.\r\n\r\nLisätietoa itse tapahtumasta: http://aatu.fi/\r\n\r\nMuuta kysyttävää? Lähetä viesti osoitteeseen\r\nolli-pekka.lindstrom at helsinki.fi\r\n\r\n---------------------------------------------------------------------------------------------------------------\r\n\r\nMatrix and TKO-äly continue the tradition of going to student events in Turku together. This time the event is a pub crawl called AATU\r\non Wednesday 16th of May.\r\n\r\nAATU is a pub crawl event in which you go around floating and other restaurants along the river Aurajoki in a unique and relaxed atmosphere.\r\n\r\nThe trip begins with the legendary bus trip to Turku. Then we will complete the pub crawl,\r\nspend the rest of the evening at the AATU afterparty and finally return to Helsinki together by bus again.\r\n\r\nThe fee of 30€ (estimate) includes a ticket for the pub crawl, admission to the\r\nafterparty as well as transportation to and from Turku.\r\n\r\nThe trip has room for 50 people, 25 for both organizations.\r\nRegistrations begin on Monday 16.4.2018 at 12 o'clock.\r\nRegistrations are binding after 13.5.2018.\r\n\r\nSchedule for the trip:\r\n12:00 Bus leaves from Kumpula\r\n3:00 Bus leaves from Turku\r\n\r\nMore information on AATU: http://aatu.fi/in-english/\r\n\r\nQuestions? Send a message to\r\nolli-pekka.lindstrom at helsinki.fi\r\n",
    "deleted": 0,
    "price": "30€, tarkentuu myöhemmin"
  },
  {
    "id": 1427,
    "name": "ATK-YTS 2018 meidän ilmo",
    "user_id": 1537,
    "created": "2018-06-06T11:00:49.000Z",
    "starts": "2018-08-10T17:30:00.000Z",
    "registration_starts": "2018-07-01T12:00:00.000Z",
    "registration_ends": "2018-08-05T17:30:00.000Z",
    "cancellation_starts": "2018-07-01T12:15:00.000Z",
    "cancellation_ends": "2018-08-05T17:30:00.000Z",
    "location": "Casa Academica, Hietaniemenkatu 7, 00100 Helsinki",
    "category": "Sitsit",
    "description": "Paras opiskelijaperinne? Sitsit. Parasta toimintaa? Yhteistoiminta.\r\n\r\nOnko ATK-YTPhen liian pitkä aika? Ikävöitkö yhteistoimintaa? Pelastuksesi on ATK-YTS (yhteistoimintasitsit), joka järjestetään tänä vuonna ensimmäistä kertaa. Juhlintaa voidaan jatkaa aamuun asti, joten yöllinen mahdottomuus poistua Helsingistä ei ole ongelma.\r\n\r\nHinta: 15€\r\n\r\nIlmoittautuminen alkaa 1.7. klo 12.00\r\n\r\nPukukoodi: oletusarvoisesti haalarit.\r\n\r\n------\r\n\r\nSitsit with CS students from all around Funland.\r\n\r\nIs ATK-YTP too far away? Are you longing for cooperative actions? Let us introduce to you: ATK-YTS (sitsit/academic dinner party) which is held for the first time. You may party till morning so do not worry about the fact that you won't be able to leave Helsinki during the night.\r\n\r\nPrice: 15€\r\n\r\nThe sign up starts 1.7. at 12:00 \r\n\r\nDresscode: overalls",
    "deleted": 1,
    "price": "15"
  },
  {
    "id": 1443,
    "name": "Ripurapujuhlat",
    "user_id": 1470,
    "created": "2018-08-07T13:10:31.000Z",
    "starts": "2018-08-26T18:00:00.000Z",
    "registration_starts": "2018-08-15T12:34:00.000Z",
    "registration_ends": "2018-08-25T18:00:00.000Z",
    "cancellation_starts": "2018-08-15T12:34:00.000Z",
    "cancellation_ends": "2018-08-25T18:00:00.000Z",
    "location": "Kattosauna Sivistys",
    "category": "Rapujuhlat",
    "description": "**Tapahtuma on kiitos TKO-älyn nykyisille ja vanhoille aktiiveille. Jos koet, että olet joskus tehnyt jotain järjestön hyväksi, olet aktiivi!**\r\n\r\nNo nu ska vi baila! Perinteikkäät läheskesäkrapuilut on täällä taas! Kattosauna Sivistyksellä odottaa ravut, snapsilaulut ja illan lähestyessä lämmin sauna. Tätä et halua missata.\r\n\r\nPukukoodi on epämuodollinen, mutta siisti. Pitkät tummat housut (vaikka mustat farkut) ja kauluspaita solmiolla tai ilman, vastaavalla kaavalla hameen tai mekon kanssa.\r\n\r\nTapahtumassa tarjoillaan pöytiin jonkin verran juomia, mutta voit tuoda myös omiasi lisäksi.\r\n\r\nJos aiot saunoa, pyyhe helpottaa huomattavasti.\r\n\r\n---\r\n\r\n**This event is a \"thank you\" for TKO-äly's present and old actives. If you feel like you have done something for the organization one can say you are a TKO-äly active!**\r\n\r\nNo nu ska vi baila! Traditional summer sitsis is here again. Snapses, singing and eating crabs at the Sivistys sauna (Leppäsuonkatu 11, Helsinki), above Klusteri. After eating the sauna will be warm.\r\n\r\nDress code is informal. Dark trousers (for example black jeans) and a button-up shirt (optionally with a tie) or appropriate dress.\r\n\r\nSnaps will be served, but you may bring your own drinks as well.\r\n\r\nIf you want to use the sauna, a towel helps a lot!",
    "deleted": 0,
    "price": "18"
  },
  {
    "id": 1432,
    "name": "ATK-YTP 2018",
    "user_id": 1447,
    "created": "2018-06-17T22:40:46.000Z",
    "starts": "2018-10-17T08:00:00.000Z",
    "registration_starts": "2018-09-19T12:00:00.000Z",
    "registration_ends": "2018-09-30T12:00:00.000Z",
    "cancellation_starts": "2018-09-19T12:00:00.000Z",
    "cancellation_ends": "2018-09-30T12:00:00.000Z",
    "location": "Turku",
    "category": "ATK-YTP",
    "description": "Ystävämme Turusta, Asteriski ry, kutsuu meidät ATK-Yhteistoimintapäiville 17.-19.10. Suomen Turkuun. Luvassa on jälleen kerran sykähdyttäviä seminaaripuheita, TiTOLin (Tietotekniikan Opiskelijoiden Liitto) syysliittokokousta, rastikierroksia ja muuta iltaohjelmaa.\r\n\r\nMajoitus aukeaa keskiviikkona klo 10.00 osoitteessa Ruiskatu 8, Turku, joten lähdemme Helsingistä liikkeelle noin klo 8 aamulla.  Luennot alkavat totuttuun tapaan kello 12.15, ja niitä ei parane missata! Paluumatkalle Turusta lähdetään perjantaina noin klo 11 majoituksen sulkeutuessa. \r\n\r\nTänäkään vuonna osallistumismaksu vuoden parhaimpaan tapahtumaan (heti TKO-älyn vujujen jälkeen) ei päätä huimaa - 15 euroa/osallistuja. Osallistumismaksu sisältää seminaaritapahtuman lisäksi pääsyn molempien iltojen jatkobileisiin. Muistutamme toki, että TiTOL sponssaa jokaista osallistujaa 5 euroa. Kuljetuksen sisältävä kokonaiskustannus tarkentuu pian.\r\n\r\nTarkemmat aikataulut ja infot ilmestyvät jatkossa alla oleville sivuille:\r\n\r\nhttp://atk-ytp.org/\r\n\r\nhttps://www.facebook.com/events/398963600616345/\r\n\r\nJos tarvitsette lisää tunnelmannostattajaa jo tässä vaiheessa, kannattaa liittyä TiTOLin Telegram-ryhmään (yhteistoimintaa!):\r\n\r\nhttps://t.me/joinchat/Cl6rokNcVUL0x6o0aGxO-g\r\n\r\n-------------------------------------\r\n\r\nOur friends in Finnish Turku, the local Computer Science student organization Asteriski ry have invited us to the annual CS student co-operation seminar ATK-YTP on October 17th through 19th in Turku, Finland. As is tradition, you can expect insightful talks, the annual meeting of TITOL (union of IT students), orienteering shenanigans and other assorted fun times.\r\n\r\nA roof over your head is provided by our gracious hosts and this room & board opens at 10 am on Wednesday the 17th, address Ruiskatu 8, so we'll commence our trip from Helsinki at around 8 am. The lectures kick off just past noon and they're not something you want to miss! The return voyage departs at roughly 11 am on Friday when the room & board closes.\r\n\r\nThe cost of this fabulous trip won't make a large hole in your wallet, only 15eur per person. This cost includes the seminar event and access to afterparties on both Wednesday and Thursday. We'd also like to remind you that TITOL will cover 5e for each person attending. The total cost of bus transportation there and back again will be clarified at a later date.\r\n\r\nA more accurate schedule and information will also be updated closer to the actual event at http://atk-ytp.org/. An event page can be found on Facebook at https://www.facebook.com/events/398963600616345/.\r\n\r\nShould you require some hype at this juncture, you can join the co-operation chat on Telegram at https://t.me/joinchat/Cl6rokNcVUL0x6o0aGxO-g, memes included.\r\n\r\nSeminar, woop woop!\r\n",
    "deleted": 0,
    "price": "25 - 35 €"
  },
  {
    "id": 1455,
    "name": "Fuksisitsit // Muiden ilmo",
    "user_id": 1470,
    "created": "2018-08-30T12:50:45.000Z",
    "starts": "2018-09-30T18:00:00.000Z",
    "registration_starts": "2018-09-20T12:00:00.000Z",
    "registration_ends": "2018-09-29T12:00:00.000Z",
    "cancellation_starts": "2018-09-20T12:00:00.000Z",
    "cancellation_ends": "2018-09-29T12:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Sitsit, eli akateemiset pöytäjuhlat, ovat tärkeä osa pohjoismaista yliopistokulttuuria. Lyhyesti sanottuna sitseillä pukeudutaan hienosti, syödään sekä juodaan, ja viimeisimpänä, muttei vähäisimpänä, lauletaan. \r\n\r\nFuksit saapuvat sitsaamaan ensimmäistä kertaa, ja vanhempien opiskelijoiden olisi suotavaa näyttää hyvää esimerkkiä ja opettaa fuksit käyttäytymään sitsisääntöjen mukaisesti. \r\n\r\nTapahtuman on tarkoitus olla oppimiskokemus fukseille, eli varauduthan käyttäytymään ihan oikeasti kunnolla.\r\n\r\n--\r\n\r\nSitsit (academic table parties) has an important role in Finnish university culture. In short: we dress up nicely, we eat and drink, and last but not the least, we sing.\r\n\r\nThis will be the first sitsit for freshers, so older students should act as role models and teach freshers the proper etiquette.\r\n\r\nThe event is supposed to be a learning experience for the freshers, so really: be on your best behaviour.",
    "deleted": 0,
    "price": "14"
  },
  {
    "id": 1403,
    "name": "TKO-älyn 30. vuosijuhlat",
    "user_id": 152,
    "created": "2018-04-23T17:23:31.000Z",
    "starts": "2018-11-10T16:00:00.000Z",
    "registration_starts": "2018-10-01T12:00:00.000Z",
    "registration_ends": "2018-10-26T18:00:00.000Z",
    "cancellation_starts": "2018-10-01T12:00:00.000Z",
    "cancellation_ends": "2018-10-26T18:00:00.000Z",
    "location": "Ravintola Paasitorni",
    "category": "Vuosijuhlat",
    "description": "TKO-älyn 30. vuotista matkaa juhlitaan tänä vuonna 10.11.2018 ravintola Paasitornissa Helsingissä. Oletpa sitten fuksi, jäärä, alumni tai yhteistyökumppanimme, olet sydämellisesti tervetullut nauttimaan hyvästä ruuasta ja seurasta kanssamme!\r\n\r\nAloitamme juhlallisuudet tervehdyksillä ja onnitteluilla klo 16:00 Exactumissa, osoitteessa Pietari Kalmin katu 5. Tämän jälkeen siirrymme juhlapaikalle ravintola Paasitorniin, Paasivuorenkatu 5A. \r\n\r\nIllallisosuuden jälkeen siirrymme jatkoille Trapfactoryyn (Metallimiehenkuja 6).\r\n\r\nSunnuntaiaamuna halukkaille on tarjolla silliaamiainen Villa Sarfvikissa. Silliaamiaisen hintaan sisältyy kyyditykset.\r\n\r\nTapahtuma-aikataulu:\r\n16:00 Cocktailtilaisuus Exactumissa\r\n18:00 Pääjuhla ravintola Paasitornissa\r\n23:00 Jatkot Trapfactoryssa\r\n\r\nSunnuntaina silliaamiainen Villa Sarfvikissa 12:00\r\n\r\nIllallisen menu:\r\n\r\nSiikaa lasimestarin tapaan, yrttimajoneesia ja kvinoa fenkolisalaattia M,G\r\n***\r\nSalviapaahdettua vasikkaa, prosciutto perunakakkua, sitruunaa ja oliivia L\r\n***\r\nSuklaabrownie ja pistaasijäätelöä L\r\n\r\nTai\r\n\r\nUunipunajuurta, sydänsalaattia ja linssivinaigrettea M,G\r\n***\r\nPrässättyä härkäpapua, juuresterriiniä ja appelsiinipinjansiemenkastiketta M,G\r\n***\r\nKookosvanukas ja karamellisoitua ananasta M,G\r\n\r\nLisätietoja tapahtumasta vuosijuhlamestarilta mozzie@loa.fi",
    "deleted": 0,
    "price": "TKO-älyn jäsen, alkoholillinen: 80€\r\nTKO-älyn jäsen, alkoholiton: 70€\r\nEi jäsen, alkoholillinen: 85€\r\nEi jäsen, alkoholiton 75€\r\nSillis: 20€"
  },
  {
    "id": 1442,
    "name": "Fuksiexcu: Solinor",
    "user_id": 1685,
    "created": "2018-08-06T14:13:17.000Z",
    "starts": "2018-10-09T17:00:00.000Z",
    "registration_starts": "2018-10-01T13:00:00.000Z",
    "registration_ends": "2018-10-05T12:00:00.000Z",
    "cancellation_starts": "2018-10-01T13:00:00.000Z",
    "cancellation_ends": "2018-10-05T12:00:00.000Z",
    "location": "Solinor,  Urho Kekkosen katu 7B",
    "category": "Yritysvierailu",
    "description": "Tapahtuman virallisen osuuden jälkeen ilta jatkuu rennon seurustelun merkeissä läheisellä saunalla. \r\n\r\nJos haluat saunoa, muistathan oman pyyhkeesi!\r\n\r\nSolinor on vuodesta 2002 lähtien toiminut ohjelmistoyritys, jonka tehtävänä on kehittää kumppaneilleen loistavia digitaalisia palveluja. Nimemme juontaa juurensa lausahdukseen ”Solutions from Innovators”, joka huokuu tekemisessämme päivästä toiseen. Palvelumme kattavat koko ohjelmistokehityksen elinkaaren digitaalisen palvelun suunnittelusta jatkuvaan kehitykseen ja ylläpitoon. Kehitämme palvelut aina vastaamaan kumppaneidemme liiketoiminnan tarpeita.\r\n\r\nExcu on tarkoitettu ensisijaisesti fukseille, mutta jos tilaa jää myös vanhemmat opiskelijat ovat tervetulleita.\r\n\r\n- - - - -\r\n\r\nThere will also be delicious food and drinks at the premises. After the official part of the excursion we will continue to a sauna nearby, where you are free to stay and chat with our employees, play board games or of course, bathe in sauna. \r\n\r\nPlease remember to bring your own towel.\r\n\r\nSolinor was founded in the year 2002, and the name is derived from the phrase “Solutions from Innovators”. Our success is built on staying consistently on our chosen track - delivering innovative solutions to our customers. We have succeeded to stay consistently on our chosen track: delivering innovative solutions to our customers.\r\n\r\nThe excursion is meant mainly for freshmen, but if there’s space, older students are also welcome.",
    "deleted": 0,
    "price": "0"
  },
  {
    "id": 1471,
    "name": "HYY150 Synttäribileet (HYY150 Birthday party)",
    "user_id": 1932,
    "created": "2018-10-22T13:04:08.000Z",
    "starts": "2018-11-24T22:00:00.000Z",
    "registration_starts": "2018-10-24T10:00:00.000Z",
    "registration_ends": "2018-11-23T23:59:00.000Z",
    "cancellation_starts": "2018-10-24T10:00:00.000Z",
    "cancellation_ends": "2018-11-18T23:59:00.000Z",
    "location": "The Circus, (Salomonkatu 1–3, 00100 Helsinki)",
    "category": "HYY150",
    "description": "Lippujen lunastus sähköpostitse janne.lofhjelm*gmail.com (korvaa * asian mukaisella merkillä) tai Telegramissa @Janz_u. Mainitse sähköpostissasi bailataan.fi tilisi sähköpostiosoite (tarvitaan lipun lunastamiseen) ja nimesi, mikäli ei selviä sähköpostiosoitteesta.\r\n\r\nRedeem tickets via email janne.lofhjelm*gmail.com (replace * accordingly) or Telegram @Janz_u. Mention your bailataan.fi username (required for redeeming ticket) and your name if it's not clear from email address.\r\n\r\nIN ENGLISH BELOW\r\n\r\nTKO-äly on ostanut 20 lippua HYYn vuosijuhlajatkoinakin toimiviin synttäribileisiin Circuksella. Bileisiin voit saapua juuri sellaisena kuin tahdot, jos tahdot. TKO-älyn kautta ostettuna saat liput halpaan ryhmälippuhintaan, joten älä missaa tilaisuutta vaan ilmoittaudu juhlistamaan ylioppilaskuntamme 150-vuotista taivalta.\r\n\r\nLisätietoja:\r\nhttps://www.hyy150.fi/tapahtumakalenteri/2018/2/6/hyy150-synttribileet\r\n\r\n------\r\n\r\nTKO-äly has just bought 20 tickets to HYY's combined anniversary party and afterparty in Circus. Comes as you are, if you want. When you buy the ticket via TKO-äly, you get special reduced group ticket price, so don't miss your chance to celebrate the landmark 150-year history of the Student Union of Helsinki University! \r\n\r\nMore info: https://en.hyy150.fi/events-1/2018/11/24/hyy150-birthday-party",
    "deleted": 0,
    "price": "12€"
  },
  {
    "id": 1484,
    "name": "Nordcloud case night: GraphQL",
    "user_id": 1992,
    "created": "2018-11-05T15:31:02.000Z",
    "starts": "2018-11-14T17:00:00.000Z",
    "registration_starts": "2018-11-05T15:23:00.000Z",
    "registration_ends": "2018-11-13T20:00:00.000Z",
    "cancellation_starts": "2018-11-05T15:23:00.000Z",
    "cancellation_ends": "2018-11-13T20:00:00.000Z",
    "location": "Nordcloud, Kamppi",
    "category": "Yritysvierailu",
    "description": "REST is Dead, All Hail GraphQL! -workshop\r\n\r\nHear, hear! Join the workshop to find out why REST is dead (or is it?) and GraphQL the new ruler. We will start by going through the basics, getting familiar with GraphQL's SDL and creating queries against an actual API. After that we will get our hands dirty building a real-world application using JavaScript, Node.js, React and Apollo stack (Apollo Server + Apollo Client).\r\n\r\nPrerequisites: At least some knowledge of JavaScript and React is recommended. Bring your laptops and make sure you have Node.js installed. https://nodejs.org/en/download/ https://nodejs.org/en/download/package-manager/\r\n\r\nFood is served during the workshop.",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1497,
    "name": "Keilaamaan HYKin kanssa (Bowling with HYK)",
    "user_id": 1854,
    "created": "2018-11-16T14:19:28.000Z",
    "starts": "2018-11-26T15:00:00.000Z",
    "registration_starts": "2018-11-17T12:00:00.000Z",
    "registration_ends": "2018-11-23T15:00:00.000Z",
    "cancellation_starts": "2018-11-17T12:00:00.000Z",
    "cancellation_ends": "2018-11-17T12:00:00.000Z",
    "location": "Ruusulan keilahalli, Ruusulankatu 3-5",
    "category": "Keilailu",
    "description": "Mennään yhdessä keilaamaan kemisti- ja käpistelijävoimin! Ruusulan hallista on varattu neljä rataa, ja pidätämme oikeuden tasata osallistujia siten, että mukaan mahtuu sopivassa suhteessa kemistejä ja käpistelijöitä. Huomaathan että ilmoittautuminen on sitova!\r\n\r\nChemistry and CS studets will go bowling together. Note that the registration is binding.",
    "deleted": 0,
    "price": "6€, including shoes"
  },
  {
    "id": 1515,
    "name": "Pikkulaskiainen 2019 (Tekiksen ilmo)",
    "user_id": 1537,
    "created": "2019-01-02T15:01:29.000Z",
    "starts": "2019-02-07T12:00:00.000Z",
    "registration_starts": "2019-01-10T12:00:00.000Z",
    "registration_ends": "2019-01-31T12:00:00.000Z",
    "cancellation_starts": "2019-01-10T12:00:00.000Z",
    "cancellation_ends": "2019-01-31T12:00:00.000Z",
    "location": "Turku",
    "category": "Appro",
    "description": "In english below.\r\n\r\nAlkuvuoden kohokohta lähestyy taas uhkaavaa vauhtia. Matrixille ja\r\nTKO-älylle jo perinteeksi muuttunut Pikkulaskiainen järjestetään tänä\r\nvuonna torstaina 7.2.2019 lempeässä Turussa.\r\n\r\nMeidän Pikkulaskiaisemme alkaa legendaarisella bussimatkalla kohti\r\nTurkua, ja päättyy siihen seuraavana yönä. Siinä välissä on mahdollista\r\nosallistua mäenlaskutapahtumaan, sekä After Ski -approon, jonka avulla\r\npääsemme kiertämään ja tutustumaan Turkuun yhä enemmän ja syvemmin.\r\n\r\nHintaa retkelle tulee 33€, joka sisältää kaiken appro-lipusta\r\njatkopaikkaan Forteen ja bussikuljetuksiin. Pelkkää lippua et siis tätä kautta\r\nvoi ostaa, vaan ostat myös kuljetuksen.\r\n\r\nMukaan mahtuu yhteensä 50 nopeinta innokasta, kummastakin järjestöstä 25. Nopeus on siis valttia, ei kannata hitailla!\r\nIlmoittautuminen alkaa tiistaina 10.1.2019 klo 12:00.\r\nIlmoittautuminen muuttuu sitovaksi 31.1.2019.\r\n\r\nTässä vielä virallinen aikataulumme:\r\n12:00 bussikuljetus lähtee Kumpulasta\r\n3:00 bussikuljetus lähtee Turusta\r\n\r\nPidätämme oikeudet muutoksiin.\r\n\r\nLisätietoa itse tapahtumasta: http://pikkulaskiainen.fi/\r\nMuuta kysyttävää? Lähetä viesti osoitteeseen\r\njasmine.lindelof at helsinki.fi. \r\n\r\n****\r\n\r\nThe highlight for the beginning year is approaching. As is tradition,\r\nTKO-äly is joining Matrix for Pikkulaskiainen on Thursday 8th of\r\nFebruary in lovely Turku.\r\n\r\nPikkulaskiainen is an off the hook student event organized annually by\r\nthe Association of Economics Students in Turku for over two decades\r\nalready. The day starts with sledging and other fun activities at the\r\nPuolala Park, followed by an “After Ski” –pub crawl in downtown Turku.\r\nThe “Winter is a party” –after parties at the city’s hottest nightclubs\r\nculminate Pikkulaskiainen.\r\n\r\nThe fee of 33€ includes a ticket for the pub crawl, admission to the\r\nafterparty in Forte aswell as transportation to and from Turku. A bus has been\r\narranged to take us there in the morning, and to bring us back after\r\nwe've given our everything.\r\n\r\nRegistrations begin on Monday 10.1.2019.\r\nRegistrations are binding after 31.1.2019.\r\n\r\nSchedule for the trip:\r\n12:00 Bus leaves from Kumpula\r\n3:00 Bus leaves from Turku\r\n\r\nMore information on Pikkulaskiainen: http://pikkulaskiainen.fi/\r\nQuestions? Send a message to \r\njasmine.lindelof at helsinki.fi.",
    "deleted": 0,
    "price": "33€"
  },
  {
    "id": 1526,
    "name": "Ystävänpäiväsitsit",
    "user_id": 1470,
    "created": "2019-01-22T11:35:59.000Z",
    "starts": "2019-02-10T18:00:00.000Z",
    "registration_starts": "2019-01-28T12:33:00.000Z",
    "registration_ends": "2019-02-09T15:00:00.000Z",
    "cancellation_starts": "2019-01-28T12:33:00.000Z",
    "cancellation_ends": "2019-02-09T15:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Hyvä ainejärjestöystävämme,\r\ntervetuloa ystävänpäiväsitseille Alinalle 10.2. klo 18!\r\n\r\nTule siis viettämään sitsejä vaaleanpunaisissa ystävänpäivätunnelmissa lempiainejärjestösi kanssa <3\r\nTeeman mukainen pukeutuminen on toivottavaa.\r\n\r\nLempeän seuran ja herkullisen ruuan lisäksi ne tavalliset syyt saapua: ei haittaa vaikkei osaisi laulaa - ei muutkaan niin osaa, ei haittaa vaikkei olisi sitsannut aiemmin - hyvä hetki opetella, ei haittaa vaikkei olisi tummaa pukua - laita jotain punaista. Eikä myöskään haittaa vaikka et tuntisi muita - tällä kertaa uusia tuttavuuksia löytyy arvotun plaseerauksen avulla!\r\n\r\nrakkain terveisin\r\nsitsitiimisi\r\n\r\n\r\n\r\nps. vaikka sitseistä toivommekin rakkaudentäyteisiä, niin järkeä saa käyttää http://wiki.hyy.fi/index.php/Yhdenvertaisuus#Turvallisemman_tilan_periaatteet\r\n\r\n-------------------------------------------------------------------------\r\n\r\nWe welcome you, our dear friends in TKO-äly,\r\nto the Valentine's Day sitsit at Alina on the 10th of February at 6pm!\r\n\r\nCome and join us in a rose-tinted celebration of friendship and love with your favourite student organization <3\r\nThematic dressing is advised.\r\n\r\nIn addition to pleasant company and delicious food, there are plenty of reasons to participate: \r\nDon't worry about being able to sing, neither can we!\r\nNever been at a sitsit before? This is a great opportunity to learn and experience it yourself.\r\nNo worries if you don't have a dark suit either; you can wear red or other thematically appropriate colours!\r\nDon't know anyone going? That's quite alright, as this time around the seating order will be randomized so everyone can discover new acquaintances!\r\n\r\nWith love,\r\nyour sitsi team\r\n\r\n\r\nps. while we wish for the party to be filled with love, let's not overdo it. Let's all be mindful of each other's boundaries <3",
    "deleted": 0,
    "price": "12"
  },
  {
    "id": 1540,
    "name": "Jyväsmetro 2019",
    "user_id": 1679,
    "created": "2019-02-21T12:19:29.000Z",
    "starts": "2019-04-25T09:30:00.000Z",
    "registration_starts": "2019-02-25T12:34:00.000Z",
    "registration_ends": "2019-03-24T09:30:00.000Z",
    "cancellation_starts": "2019-02-25T12:34:00.000Z",
    "cancellation_ends": "2019-02-25T12:34:00.000Z",
    "location": "Jyväskylä",
    "category": "Ulkopaikkakuntaexcu",
    "description": "Vappu lähestyy ja jo monivuotinen perinne jatkuu, nimittäin TKO-älyn reissu rakkaiden Jyväskylän käpistelijöiden luokse Jyväsmetron merkeissä.\r\n\r\nJyväsmetro on jo legendaksi muodostunut \"metro\", jossa pääsee näkemään Jyväskylän, sen opiskelijat ja mielenkiintoisimmat lähiöbaarit - mahtavia jatkoja unohtamatta!\r\n\r\nAsiasta löytyy myös havainnollistavaa videomateriaalia: https://www.youtube.com/watch?v=CRxWB8pxTbo\r\n\r\nTapahtuman liput maksavat 15€ normi- ja 25€ VIP-lippu. VIP lipussa ekstrana löytyy VIP-linjan oma ajoneuvo, puuhapussi, kuohuviinitarjoilut ja jatkoilla jonon ohitus.\r\n\r\nRiittyen tapahtuman menekistä TKO-äly saattaa järjestää tilausbussin, jos saadaan hinta järkeväksi (Alle onnibus/VR). Tästä syystä ilmoittautumiset ovat SITOVIA.\r\n\r\nMetroilevin terveisin,\r\nSami Nurmivaara\r\nPuheenjohtaja sekä Jyväskyläasiantuntija\r\n\r\n----\r\n\r\nThe (subjectively) best event of the spring time is soon here!\r\n\r\nTraditional Jyväsmetro is back! Jyväsmetro consists of touring suburban restaurants/bars of Jyväskylä by bus. It's an excellent chance to get to know Finnish countryside better.\r\n\r\nTKO-äly will be joining this joyous event and get to enjoy the company of Jyväskylä computer scientists riding buses around visiting local bars.\r\n\r\nThere are 2 tiers of tickets (not including getting to Jyväskylä) available: normal for 15€ and 25€ for VIP-tickets. VIP ticket contains some sparkling wine, a bag of goodies for the event and queue skipping for the after party.\r\n\r\nAs the event needs us to figure out transportation and tickets, the sign-ups are BINDING\r\n\r\nGreetings from undergound,\r\nSami Nurmivaara\r\nChair of board and Jyväskylä enthusiast",
    "deleted": 0,
    "price": "15€ / 25€ + transportation fees (around 20€)"
  },
  {
    "id": 1544,
    "name": "Helsinginkadun Appro 2019",
    "user_id": 1726,
    "created": "2019-03-05T12:17:50.000Z",
    "starts": "2019-04-10T17:45:00.000Z",
    "registration_starts": "2019-03-13T12:00:00.000Z",
    "registration_ends": "2019-04-01T12:00:00.000Z",
    "cancellation_starts": "2019-03-13T12:00:00.000Z",
    "cancellation_ends": "2019-04-01T12:00:00.000Z",
    "location": "Helsinginkatu, Kallio",
    "category": "Appro",
    "description": "Helsinginkadun Appro, tuo opiskelijatapahtumista lähes pelätyin, jolloin suurin osa Helsingin haalarikansasta nousee ulos koloistaan ja pakkautuu halvoista tuopeista ja boheemista menosta tunnetulle maantieteelliselle alueelle, tulee taas JÄLLEEN KERRAN!\r\n\r\nTKO-äly on tänä vuonna hankkinut 60 lippua ja siis approilemaan ollaan menossa, jos ei käynyt ilmi.\r\n\r\nEtkö tiedä miten appro toimii? Osallistumismaksun hinnalla saat suorituskortin, osallistuvista ravitsemusliikkeistä alennushintaisia alkoholijuomia ja rannekkeen, jolla pääsee jatkoille. Vedä siis haalarit jalkaan ja liity hauskanpitoon!\r\n\r\nHuomaathan, että ilmoittautumisajan päätyttyä sitoudut maksamaan lipun.\r\n\r\nKierros alkaa Mascotista (Neljäs linja 2).\r\n\r\nP.S. ainejärjestön epävirallinen ennätys Tohtorisuoritukseen (16 merkintää) on noin 22 minuuttia.\r\n\r\n-----------------------\r\n\r\nHelsinginkadun Appro, perhaps one the most known of all the pub crawls is here again and TKO-äly has acquired 60 tickets! You know you want to!\r\n\r\nWhat's a pub crawl? For the price of admission you get a \"report card\", discounts for drinks in participating bars and a ticket to the afterparty, so put on your overalls and join the fun!\r\n\r\nPlease note that you agree to pay for the ticket after the registration has closed.\r\n\r\nThe pub crawl starts from Bar Mascot, Neljäs Linja 2.\r\n\r\nP.S. the unofficial record for a doctoral degree in this event is roughly 22 minutes.",
    "deleted": 0,
    "price": "13€"
  },
  {
    "id": 1565,
    "name": "Excursion: Futurice",
    "user_id": 1175,
    "created": "2019-04-02T14:18:06.000Z",
    "starts": "2019-04-23T17:00:00.000Z",
    "registration_starts": "2019-04-10T12:00:00.000Z",
    "registration_ends": "2019-04-23T17:00:00.000Z",
    "cancellation_starts": "2019-04-10T12:00:00.000Z",
    "cancellation_ends": "2019-04-21T23:59:00.000Z",
    "location": "Annankatu 34 B, 8th floor, Helsinki",
    "category": "Yritysvierailu",
    "description": "At Futurice we build digital services that people love, and help our clients to navigate a successful digital future. We are a lean service creation company. This means software development, design, and business advisory under one roof. In our core we have the software development and data science as it covers about 65% of our over 550 futuriceans.\r\n\r\nWe believe in care, trust and transparency. Our unique culture enables innovations. Join the excursion to meet us and hear more about Futurice!\r\n\r\nTimetable:\r\n- Food & drinks\r\n- Quick presentation and questions about Futurice\r\n- TBA: program related to working at Futurice\r\n- Sauna & hanging out",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1554,
    "name": "Smartly.io excursion (with Digit and Tietokilta)",
    "user_id": 1080,
    "created": "2019-03-15T17:00:42.000Z",
    "starts": "2019-03-27T17:00:00.000Z",
    "registration_starts": "2019-03-18T12:12:00.000Z",
    "registration_ends": "2019-03-21T14:14:00.000Z",
    "cancellation_starts": "2019-03-18T12:12:00.000Z",
    "cancellation_ends": "2019-03-21T14:14:00.000Z",
    "location": "Smartly, Elielinaukio 2 G, 00100 Helsinki",
    "category": "Excu",
    "description": "Smartly.io welcomes Digit, Tietokilta and TKO-äly to experience the scale and complexity of the technical challenges we are tackling! Come meet Smartlies and fellow CS students at our office in the heart of Helsinki. \r\n\r\nDuring the evening our developers from different engineering teams will share their knowledge on rendering customisable video templates in scale, managing loads of ad statistics using Citus and our own Distillery service with its purpose-built query language. We look forward to lots of questions and open discussion, while also working hands-on with our brand new tech challenge. \r\n\r\nWe’re also happy to talk about our internship positions and share what being a developer at Smartly.io is like. \r\n\r\nAgenda:\r\n•\t5 pm: Starting the excursion, food and drinks\r\n•\t5.15–6.30 pm: Presenting and discussing themes\r\n•\t6.30–7.30 pm: Working hands-on with tech challenge\r\n•\t7.30-21 pm: Talking with Smartlies and fellow students\r\n\r\nSee you on the 27th of March!\r\n\r\nWith warm regards,\r\nthe Smartly.io team.\r\n\r\nP.S. Bringing your laptop with you is highly recommended.\r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1584,
    "name": "Elisa case night: 5G",
    "user_id": 2006,
    "created": "2019-05-06T21:11:06.000Z",
    "starts": "2019-05-13T17:00:00.000Z",
    "registration_starts": "2019-05-08T12:00:00.000Z",
    "registration_ends": "2019-05-13T12:00:00.000Z",
    "cancellation_starts": "2019-05-08T12:00:00.000Z",
    "cancellation_ends": "2019-05-09T12:00:00.000Z",
    "location": "Ratavartijankatu 5, Helsinki",
    "category": "Yritysvierailu",
    "description": "We have already stepped into the age of 5G. What does this mean technology-wise? Come hear some of our best developers and tech experts talk about what 5G means to them, and of course mingle and network with perhaps your future colleagues!\r\n\r\nHow to find the right place: When arriving from Ratapihantie, take the escalators up between Lidl and Alko, and go to your right at the top of the escalators until you reach the main doors. If arriving from Ratavartijankatu, walk to the very end of the street and take the stairs up to your right. If you arrive by car, there’s free customer parking in Elisa’s parking hall, on the upper floor. Drive in from Ratavartijankatu and follow the signs.\r\n\r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1553,
    "name": "Vappusitsit (tekisläisten ilmo)",
    "user_id": 1470,
    "created": "2019-03-15T09:06:49.000Z",
    "starts": "2019-04-29T19:00:00.000Z",
    "registration_starts": "2019-04-14T14:00:00.000Z",
    "registration_ends": "2019-04-27T20:00:00.000Z",
    "cancellation_starts": "2019-04-14T14:00:00.000Z",
    "cancellation_ends": "2019-04-27T20:00:00.000Z",
    "location": "Agroksenmäen holvikellari, Vanha Talvitie 14 Helsinki",
    "category": "Sitsit",
    "description": "Vappu tulee, oletko valmis? Näin ollen tulevat myös Tekiksen perinteiset Vappusitsit! Jatkat tahi vasta aloittelet vapunviettoa sitseillä, pääset tekemään sen hyvässä seurassa nauttien huipputarjoiluista. Hurjimmat vapunviettäjät jatkavat juhlintaa läpi yön Klusterilla seuraavan päivän A.I. Virtasen aukiota varten! \r\n\r\nMITÄ: Vappusitsit \r\nMISSÄ: Agroksenmäen Holvikellari, Vanha Talvitie 14 Helsinki \r\nMILLOIN: 29.4.2019 19.00 \r\nMIKSI: Vappu + Sitsit = <3 \r\nHINTA: 17e \r\nKENELLE: Kaikille TKO-äly-mielisille (myös ei-jäsenille) \r\nPUKUKOODI: Haalarit ja vappuhassuttelu \r\n\r\n---------- \r\n\r\nVappu is here and so is TKO-äly’s legendary Vappu sits party <3 Come and get your Vappu groove on with fun sits spirit(s), delicious food, and awesome people! The most dedicated Vappu-people will continue the celebrations at Klusteri all night, and at the campus the next day. \r\n\r\nWHAT: Vappu sits party \r\nWHERE: Holvikellari of Agroksenmäki, Vanha Talvitie 14 Helsinki \r\nWHEN: 29.4.2019 19.00 \r\nWHY: Because Vappu \r\nPRICE: 17e \r\nFOR WHO: For everyone who loves TKO-äly (also non-members)\r\nDRESSCODE: Overall and something fun ",
    "deleted": 0,
    "price": "17"
  },
  {
    "id": 1588,
    "name": "Rapurallaa",
    "user_id": 1470,
    "created": "2019-05-20T11:53:33.000Z",
    "starts": "2019-08-23T18:00:00.000Z",
    "registration_starts": "2019-08-08T08:00:00.000Z",
    "registration_ends": "2019-08-22T20:00:00.000Z",
    "cancellation_starts": "2019-08-08T08:00:00.000Z",
    "cancellation_ends": "2019-08-22T20:00:00.000Z",
    "location": "Kattosauna Sivistys, Domus Gaudium, Leppäsuonkatu 11",
    "category": "Sitsit",
    "description": "Helan går och hoppsansa, det är  kräftfiskesäsongen igen!\r\nhttps://www.youtube.com/watch?v=mcxUebevDHY\r\n\r\n**Tapahtuma on kiitos TKO-älyn nykyisille ja vanhoille aktiiveille. Jos koet, että olet joskus tehnyt jotain järjestön hyväksi, olet aktiivi!**\r\n\r\nPerinteiset aktiiviset rapujuhlat ovat täällä taas! Kattosauna Sivistyksellä odottaa ravut, snapsilaulut ja ruuan loputtua lämmin sauna. Tätä et halua missata.\r\n\r\nPukukoodi on epämuodollinen, mutta siisti. Pitkät tummat housut (vaikka mustat farkut) ja kauluspaita solmiolla tai ilman, ja vastaavalla kaavalla jos haluat housujen sijasta hameen tahi mekon.\r\n\r\nTapahtumassa tarjoillaan pöytiin jonkin verran juomia, mutta voit tuoda myös omiasi lisäksi.\r\n\r\nJos aiot saunoa, pyyhe helpottaa huomattavasti.\r\n\r\n\r\n**This event is a \"thank you\" for TKO-äly's present and old actives. If you feel like you have done something for the organization one can say you are a TKO-äly active!**\r\n\r\nTraditional crayfish sitsi party is here again. Snapses, singing and eating crabs at the Sivistys sauna (Leppäsuonkatu 11, Helsinki), above Klusteri. After eating the sauna will be warm.\r\n\r\nDress code is informal. Dark trousers (for example black jeans) and a button-up shirt (optionally with a tie) or appropriate dress.\r\n\r\nSnaps will be served, but you may bring your own drinks as well.\r\n\r\nIf you want to use the sauna, a towel helps a lot!",
    "deleted": 0,
    "price": "18"
  },
  {
    "id": 1631,
    "name": "Fuksisitsit // Muiden ilmo",
    "user_id": 1470,
    "created": "2019-09-18T12:47:22.000Z",
    "starts": "2019-10-07T18:00:00.000Z",
    "registration_starts": "2019-09-20T12:00:00.000Z",
    "registration_ends": "2019-10-06T12:00:00.000Z",
    "cancellation_starts": "2019-09-20T12:00:00.000Z",
    "cancellation_ends": "2019-10-06T12:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Sitsit, eli akateemiset pöytäjuhlat, ovat tärkeä osa pohjoismaista yliopistokulttuuria. Lyhyesti sanottuna sitseillä pukeudutaan hienosti, syödään sekä juodaan, ja viimeisimpänä, muttei vähäisimpänä, lauletaan. \r\n\r\nFuksit saapuvat sitsaamaan ensimmäistä kertaa, ja vanhempien opiskelijoiden olisi suotavaa näyttää hyvää esimerkkiä ja opettaa fuksit käyttäytymään sitsisääntöjen mukaisesti. \r\n\r\nTapahtuman on tarkoitus olla oppimiskokemus fukseille, eli varauduthan käyttäytymään ihan oikeasti kunnolla.\r\n\r\n--\r\n\r\nSitsit (academic table parties) has an important role in Finnish university culture. In short: we dress up nicely, we eat and drink, and last but not the least, we sing.\r\n\r\nThis will be the first sitsit for freshers, so older students should act as role models and teach freshers the proper etiquette.\r\n\r\nThe event is supposed to be a learning experience for the freshers, so really: be on your best behaviour.",
    "deleted": 0,
    "price": "15"
  },
  {
    "id": 1591,
    "name": "TKO-älyn 31. vuosijuhlat / 31st annual gala",
    "user_id": 2006,
    "created": "2019-05-27T20:52:44.000Z",
    "starts": "2019-11-09T16:00:00.000Z",
    "registration_starts": "2019-09-29T12:00:00.000Z",
    "registration_ends": "2019-10-31T23:59:00.000Z",
    "cancellation_starts": "2019-09-29T12:00:00.000Z",
    "cancellation_ends": "2019-10-27T23:59:00.000Z",
    "location": "Ravintola Pörssi, Fabianinkatu 14",
    "category": "Vuosijuhla",
    "description": "---IN ENGLISH BELOW---\r\n\r\nTKO-älyn 31. vuosijuhlia vietetään tänä vuonna 9.11.2019 ravintola Pörssissä Helsingissä. Oletpa sitten fuksi, jäärä, alumni tai yhteistyökumppanimme, olet sydämellisesti tervetullut nauttimaan hyvästä ruuasta ja seurasta kanssamme!\r\n\r\nAloitamme juhlallisuudet onnitteluilla ja kuohuviinillä klo 16:00 Alina-salissa Uudella ylioppilastalolla (Mannerheimintie 5 A, 3. kerros). Cocktail-tilaisuudesta siirrytään ravintola Pörssiin, jossa illallinen alkaa kello 18:00. Juhlan aikana nautimme maittavan menun, laulamme sitsilauluja ja kuulemme puheita.\r\n\r\nSunnuntaiaamuna halukkaille on tarjolla silliaamiainen perinteikkäällä Siltasaaren saunalla (Paasivuorenkatu 3) kello 10:00 alkaen.\r\n\r\nMenu:\r\n\r\nLohipastrami, sitruunajugurttia\r\n***\r\nChateaubriand, maa-artisokkaperunaa ja yrtti-\r\nvoikastiketta\r\n***\r\nMustikkasavariini ja kardemumma-vaniljakastike\r\n\r\nTAI\r\n\r\nTatti-palsternakkatartar, savumantelia\r\n***\r\nPapu-tryffelikroketti, punajuurikastike\r\n***\r\nMustaherukka-suklaaleivos\r\n\r\nIllalliskortti jatkoineen maksaa 60 euroa TKO-älyn jäsenille ja 65 euroa ei-jäsenille. Silliaamiainen on 15 euroa. Pukukoodina frakki tai tumma puku, sekä akateemiset kunniamerkit. \r\n\r\nTapahtuma Facebookissa: www.facebook.com/events/2342272276101659/\r\n\r\nTänä vuonna vuosijuhlat huipentuvat akateemisiin tansseihin, joita varten harjoittelemme vuosijuhlaviikonloppua edeltävänä keskiviikkona 6.11. kello 16 alkaen Wilhelmsson-salissa (Mannerheimintie 5 A, 5. kerros).\r\n\r\n-----------------------------------------------------\r\n\r\nTKO-äly ry celebrates its 31st anniversary on Saturday 9.11.2019 at restaurant Pörssi. Whether you are a fresher or a bit more advanced student, you are warmly welcome to join us and enjoy good food and even better company.\r\n\r\nThe festivities will begin with a reception at Alina hall at 4 PM (Mannerheimintie 5A), where sparkling wine will served and greetings for TKO-äly will be heard. Dinner will be served at Restaurant Pörssi at 6 PM. During the dinner we will enjoy a three-course meal, sing academic songs and listen to inspiring speeches.\r\nOn the next day there will be a traditional “sillis” Sunday morning brunch including sauna, snacks and some sparkling wine at Siltasaari Sauna (Paasivuorenkatu 3) starting at 10 AM.\r\n\r\nMenu:\r\n\r\nSalmon pastrami, lemon yoghurt\r\n***\r\nChateaubriand served with Jerusalem artichoke spiced potatoes, herb and butter sauce\r\n***\r\nBlueberry savarin and cardamom-vanilla sauce\r\nOR\r\nMushroom-parsenip tartare, smoked almond\r\n***\r\nBean-truffle croquette, beetroot sauce\r\n***\r\nBlackcurrant-chocolate pastry\r\n\r\nThe cost of participation is 60 euros for members of TKO-äly and 65 euros for other guests. The price includes the reception, dinner with drinks and the afterparty at Alina hall. The cost for the Sillis is 15 euros. Dress code: white tie or black tie and academic decorations.\r\n\r\nFacebook event: www.facebook.com/events/2342272276101659/\r\n\r\nThis year the party culminates in a few traditional academic ballroom dances. There will be a dance rehearsal before the event, and it will be held on Wednesday 6.11.2019 at Wilhelmsson Hall (Mannerheimintie 5 A, 5th floor) starting at 4 PM.",
    "deleted": 0,
    "price": "65 € (Jäsen 60 €)"
  },
  {
    "id": 1664,
    "name": "Slush Helsinki 2019 ticket raffle",
    "user_id": 1679,
    "created": "2019-11-08T12:30:08.000Z",
    "starts": "2019-11-13T18:00:00.000Z",
    "registration_starts": "2019-11-13T08:00:00.000Z",
    "registration_ends": "2019-11-13T17:00:00.000Z",
    "cancellation_starts": "2019-11-13T08:00:00.000Z",
    "cancellation_ends": "2019-11-13T17:00:00.000Z",
    "location": "Internet",
    "category": "Arvonta / Raffle / Lottery",
    "description": "TKO-äly on saanut käsiinsä 10kpl lippuja Slush Helsinki 2019 -tapahtumaan. Tähän tapahtumaan Tekiksen kalenterissa ilmoittautuneiden kesken arvotaan nuo liput. Voittajille ilmoitetaan henkilökohtaisesti.\r\n\r\nTKO-äly has gotten 10 tickets for the start-up event Slush Helsinki 2019. The tickets will be raffled between everyone who has participated in this \"event\" in TKO-äly calendar. The winners will be contacted privately.\r\n\r\n///\r\n\r\nHi you, talent!\r\n\r\nThis year at Slush, we have a heavy focus on bringing in current and future talent to get to know the world of startups and technology. We want to showcase some of the most interesting and actually world-changing technologies, as well as present the fastest-growing success stories of Europe.\r\n\r\nWe at Slush would love to have 10 students from TKO-äly to our event. This is probably a one-off opportunity, and we want to be clear that this probably won’t repeat in the future.\r\n\r\nThe fastest way to get to know Slush is spending 73 seconds on this video https://www.youtube.com/watch?v=ENtFYNq_78U\r\n\r\nDiscussions this year:\r\n\r\nBreaking Taboos: How to solve problems the world refuses to talk about and algorithms discriminate? | Valentina Milanova, Founder and CEO of Daye, Andrea Barrica, Founder and CEO of O.school & Sophia Bendz, Partner at Atomico\r\n\r\nData, the new rules | Andreas Weigend, former Chief Scientist of Amazon, the author of Data for the People\r\n\r\nBringing back supersonic flight | Blake Scholl, founder & CEO at Boom Supersonic\r\n\r\n...also lab-grown leather, carbon removal technologies, and many other sci-fi feeling technologies that are already real products\r\n\r\nPlease find a short one-pager attached, and the Slush Agenda over here https://www.slush.org/events/helsinki/agenda-2019\r\n\r\nBest regards,\r\nSlush team 2019\r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1704,
    "name": "PERUTTU Helsinginkadun appro 2020 // 16.30 Lähtö",
    "user_id": 2382,
    "created": "2020-02-06T12:24:14.000Z",
    "starts": "2020-09-30T16:30:00.000Z",
    "registration_starts": "2020-02-20T12:00:00.000Z",
    "registration_ends": "2020-08-28T08:00:00.000Z",
    "cancellation_starts": "2020-02-20T12:00:00.000Z",
    "cancellation_ends": "2020-09-20T12:00:00.000Z",
    "location": "Kallio",
    "category": "Appro",
    "description": "HUOM! Tapahtuma on peruttu vallitsevan koronavirustilanteen vuoksi. Lippujen siirtämisestä keväälle 2021 / uusintailmoittautumisesta tiedotetaan myöhemmin.\r\n\r\n**\r\n\r\nNOTE! The event has been cancelled due to the current situation. \r\n\r\n----\r\n\r\nHelsinginkadun Appro, tuo opiskelijatapahtumista lähes pelätyin, jolloin suurin osa Helsingin haalarikansasta nousee ulos koloistaan ja pakkautuu halvoista tuopeista ja boheemista menosta tunnetulle maantieteelliselle alueelle, tulee taas JÄLLEEN KERRAN!\r\n\r\nTKO-äly on tänä vuonna hankkinut 60 lippua ja siis approilemaan ollaan menossa, jos ei käynyt ilmi.\r\n\r\nEtkö tiedä miten appro toimii? Osallistumismaksun hinnalla saat suorituskortin, osallistuvista ravitsemusliikkeistä alennushintaisia alkoholijuomia ja rannekkeen, jolla pääsee jatkoille. Vedä siis haalarit jalkaan ja liity hauskanpitoon!\r\n\r\nHuom! Jos suoritat ensimmäisiä merkkejä eli approbaturia (A) tai cum laudea (C), niin suosithan klo 18:00 lähtöä mahdollisuuksien mukaan sillä myöhempien merkkien suoritukseen menee enemmän aikaa.\r\n\r\nHuomaathan, että ilmoittautumisajan päätyttyä sitoudut maksamaan lipun.\r\n\r\n-----------------------\r\n\r\nHelsinginkadun Appro, perhaps one the most known of all the pub crawls is here again and TKO-äly has acquired 60 tickets! You know you want to!\r\n\r\nWhat's a pub crawl? For the price of admission you get a \"report card\", discounts for drinks in participating bars and a ticket to the afterparty, so put on your overalls and join the fun!\r\n\r\nIf you are aiming for the first or second badges (A and C), please register to the 18:00 start is possible because doing the latter badges takes longer.\r\n\r\nPlease note that you agree to pay for the ticket after the registration has closed.",
    "deleted": 0,
    "price": "13€"
  },
  {
    "id": 1708,
    "name": "PERUTTU//CANCELLED Jyväsmetro 2020",
    "user_id": 1679,
    "created": "2020-02-10T12:26:28.000Z",
    "starts": "2020-04-23T10:00:00.000Z",
    "registration_starts": "2020-03-02T12:34:00.000Z",
    "registration_ends": "2020-03-13T12:34:00.000Z",
    "cancellation_starts": "2020-03-02T12:34:00.000Z",
    "cancellation_ends": "2020-03-02T12:34:00.000Z",
    "location": "Jyväskylä",
    "category": "Appro",
    "description": "HUOM!!\r\nTapahtuma on valitettavasti peruutettu tämänhetkisen tilanteen vuoksi.Tapahtuman järjestäjät ovat ilmoittaneet, että Jyväsmetro tullaan järjestämään 10.9.2020. Uudesta ilmoittautumisesta tiedotetaan tilanteen edetessä.\r\n\r\nNOTE!!\r\nUnfortunately this event has been cancelled. The organizers have announced, that Jyvärmetro will be held on 10.9.2020. There will be a new sign-up, and we'll keep you posted on the situation.\r\n\r\n---\r\n\r\nJyväsmetro, tuo vappuviikon Jyväskyläläisin tapahtuma tulee jälleen ja TKO-äly lähtee jälleen valloitusreissulle susirajan taakse!\r\n\r\nNäin paikalliset asukkaat kuvailevat tapahtumaa:\r\n\r\n\"Vapun alla on aika tutustuttaa opiskelijat Jyväskylän lähialueen ravintolatarjontaan Jyväsmetron merkeissä! Vapun vauhdikkaimmassa tapahtumassa hypätään Mattilanniemestä metron jousille ja lähdetään nauttimaan autenttisesta lähiökulttuurista hyvällä porukalla hymy huulilla ja kevätaurinko rinnassa!\r\n\r\nJokaisella metrolinjalla on mukana asiantunteva matkaopas joka saa Alanyan pakettimatkojen oppaat näyttämään budjettiluokan harrastelijoilta! Oppaat vastaavat metrojen viihtyvyydestä ja yleissivistävistä nice to know - faktoista matkan varrella!\r\n\r\nVIP-linja takaa jokaiselle kyydissäolijalle unohtumattoman startin vappuun alkaen jo metroon nousemisesta! VIP-linjalla matkustavat saavat mukaansa puuhapussin sisältäen kaikkea supermahtavaa! Heille on mm. luvassa kuohuviinitarjoilu ja jonon ohitus jatkoille. Vappu V-I-P:nä on vappu voittajana!\"\r\n\r\nOstamme tilausbussin johon tulee 30 tekisläistä ja 20 Tampereen käpistelijää eli luuppilaista\r\n\r\nIlmottautuminen on sitova.\r\n\r\nTapahtuma on avoin kaikille, joten nappaa lempikaverisi, matemaatikko, ihastukset tai vaikkapa kemisti matkaan!\r\n\r\n///\r\n\r\nThe most jyväskyläing event of Vappu is here once again and TKO-äly sets their conquest to the vast wilderness beyond the last line of civilization, kehä 3.\r\n\r\nThe event includes a \"metro\" ride in a bus to the most charming suburbs and their bars in Jyväskylä. You have the choice of normal or VIP ticket (15€/25€ respectively), where the main difference is the \"metro\" you are in and VIP includes a fun bag for the ride (usually some snacks, soda and beer/cider) and sparkling wine during the first stop + skip the queue to the afterparty\r\n\r\nWe will have a private bus where there will be 30 of us and 20 CS students of Tampere, otherwise known as Luuppians.\r\n\r\nThe event is open for everyone, so bring along your friends, mathematicians, crushes or a chemist!\r\n\r\nRegistration is binding.",
    "deleted": 0,
    "price": "Normal: 32€ (inc. bus)\r\nVIP: 40€ (inc. bus)"
  },
  {
    "id": 1724,
    "name": "Pääsiäisen karanteenisitsit // Easter Quarantine Sits",
    "user_id": 2006,
    "created": "2020-04-01T13:46:36.000Z",
    "starts": "2020-04-12T16:30:00.000Z",
    "registration_starts": "2020-04-03T15:51:00.000Z",
    "registration_ends": "2020-04-11T16:30:00.000Z",
    "cancellation_starts": "2020-04-03T15:51:00.000Z",
    "cancellation_ends": "2020-04-11T16:30:00.000Z",
    "location": "Internet",
    "category": "Sitsit",
    "description": "--- IN ENGLlSH BELOW ---\r\n\r\nTuntuuko siltä, että kaikki on nykyään peruttu? Ei huolta, sillä nämä sitsit eivät peruunnu koronan johdosta!\r\n\r\nTKO-äly järjestää ensimmäiset laatuaan olevat etäsitsit pääsiäissunnuntaina 12.4. klo 16:30 alkaen. Sitsaajat pysyvät turvallisesti omien verkkolaitteidensa äärellä ja yhteydenpito luonnistuu Zoomin avulla. Ruoasta ja juomasta osallistujat vastaavat itse, mutta tulemme antamaan esimerkkimenun ja ohjeet sen toteuttamiseen. Halutessaan sitsaaja saa toteuttaa osallistumisessaan pääsiäisteemaa haluamassaan määrin.\r\n\r\nAloitamme sitsit hyvissä ajoin, jotta saamme varmasti tekniikan toimimaan kaikilla ennen pöytiin siirtymistä. Lisäksi tavoitteena on päättää sitsit ajoissa, jotta naapurit ja kämppikset eivät häiriintyisi liikaa.\r\n\r\nSitsien tekninen toteutus tapahtuu Zoomissa, jossa voimme kokoontua kaikki samaan ‘huoneeseen’ laulamaan ja muulloin jakaantua pienempiin pöytäseurueisiin. Zoomista tarvitaan työpöytä- tai mobiilisovellus, selainversio ei riitä. Perusohjeet Zoomia varten löytyvät täältä https://helpdesk.it.helsinki.fi/ohjeet/yhteydenpito-ja-julkaiseminen/videokokoukset/zoom. \r\n\r\nLinkki Zoom-kokoukseen lähetetään osallistujien sähköpostiin ilmoittautumisajan jälkeen.\r\n\r\n\r\nAIKA: Sunnuntai 12.4.2020 klo 16:30, pöytiin siirrytään n. klo 17\r\n\r\nPAIKKA: Oma koti tai muu vastaava paikka, jossa olet\r\n\r\nMENU: Omavalintainen kolmen ruokalajin illallinen. Menuehdotus resepteineen https://docs.google.com/document/d/1yEaUdXO07j7aiTE1Pc1C0d0mvRHu6ioCWxA9awjt1qo/edit?usp=sharing\r\n\r\nJUOMAT: Jos mahdollista, niin varaudu mieleiselläsi viinillä, snapsilla ja avecilla tai korvaavilla tuotteilla sekä vedellä.\r\n\r\nPUKUKOODI: Pue päällesi mieleisesi sitsiasu. Jos olet videoyhteyden päässä, niin muista että vilauttelu on kielletty, joten housut/muu siveellinen alaosa kannattanee pukea vähintään fuksilaulun ajaksi.\r\n\r\nLAULUT: Sitseille tehdään läsy jossain muodossa. Toiveita ja korona-aiheisia lauluja ja lisäsäkeistöjä voi lähettää ilmoittautumislomakkeen kautta. Lisäksi esille saa kaivaa laulukirjan. Myös laulum.me on käytössä.\r\n\r\n---------\r\n\r\nDo you feel like everything has been cancelled? No worries, because at least these sits won’t be cancelled because of the Corona virus.\r\n\r\nTKO-äly organizes its first ever remote sits on Easter Sunday 12 April, starting at 4:30pm. The attendees will stay safely home (or wherever) and the communication between them will happen over the internet with Zoom. The participants have to take care of their own food and beverages, but there will be an example menu with instructions. You can also put an Easter twist to your menu or attire.\r\n\r\nWe will start the sits early, in order to ensure that the connections work before we move to the tables. We also aim to end the sits early so the neighbours and roommates won’t be disturbed too much.\r\n\r\nThe event takes place in Zoom, where we all can gather in the same ‘room’ to sing and otherwise be divided into smaller table groups. You will need Zoom’s desktop or mobile application, the browser application won’t be sufficient. You will find the basic instructions for Zoom here: https://helpdesk.it.helsinki.fi/en/instructions/collaboration-and-publication/video-conferencing/zoom.\r\n\r\nThe link to the Zoom meeting will be sent to all of the participants via email after the registration period.\r\n\r\n\r\nTIME: Sunday 12 April 2020 at 4:30pm., we will move to the tables around 5pm\r\n\r\nPLACE: Your own home, or wherever you may be\r\n\r\nMENU: Three course dinner by your own choice. An example menu with the recipes included for tips and inspiration https://docs.google.com/document/d/1yEaUdXO07j7aiTE1Pc1C0d0mvRHu6ioCWxA9awjt1qo/edit?usp=sharing\r\n\r\nBEVERAGES: If possible wine, schnapps and a coffee avec you like or other substitutive beverages. Also, remember water.\r\n\r\nDRESSCODE: You can wear a sits outfit or your own choosing. If you’re using a video connection, remember that flashing is forbidden so we recommend wearing pants, at least during the Fresher song.\r\n\r\nSONGS: There will be a song leaflet in some form. Song wishes and Corona themed songs and extra verses can be sent via the registration form. You can also use your own song book and laulum.me. \r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1740,
    "name": "TKO-älyn kevätkokous 2020",
    "user_id": 2006,
    "created": "2020-06-15T20:48:28.000Z",
    "starts": "2020-06-30T18:00:00.000Z",
    "registration_starts": "2020-06-16T12:00:00.000Z",
    "registration_ends": "2020-06-23T18:00:00.000Z",
    "cancellation_starts": "2020-06-16T12:00:00.000Z",
    "cancellation_ends": "2020-06-23T18:00:00.000Z",
    "location": "Christina Regina, Domus Gaudium, Leppäsuonkatu 11",
    "category": "Yhdistyksen kokous",
    "description": "TKO-äly ry:n sääntömääräinen yhdistyksen kevätkokous pidetään tiistaina 30.6.2020 kello 18.00 alkaen Christina Reginan kerhohuoneessa osoitteessa Leppäsuonkatu 11.\r\n\r\nKevätkokouksessa käydään läpi vuoden 2019 toimintakertomus ja tilinpäätös sekä päätetään vastuuvapauden myöntämisestä vuoden 2019 hallitukselle. Kokouksessa käsitellään myös lisätalousarvio vuodelle 2020 sekä muutosehdotus järjestön talousohjesääntöön.\r\n\r\nLisäksi kokouksessa päätetään kauden 2020-2021 jäsenmaksukausista ja niiden hinnoista.\r\n\r\nKokoukseen ovat tervetulleita kaikki TKO-älyn jäsenet. Kokouksessa läsnä olevien nimet kirjataan TKO-älyn jäsenten luettavissa olevaan pöytäkirjaan.\r\n\r\nTKO-älyn hallituksen päätöksellä kokoukseen osallistuminen edellyttää ilmoittautumista etukäteen. Ilmoittautuminen aukeaa ti 16.6. klo 12:00 ja päättyy ti 23.6. Klo 18:00. Lisäksi hallitus on päättänyt myös sallia etäosallistuminen kokouksen aikana videoviestintäpalvelu Zoomin kautta. Myös etäosallistuminen edellyttää ilmoittautumista. Päätökset pohjautuvat 1.5.2020 voimaan tulleesen poikkeuslakiin (https://valtioneuvosto.fi/paatokset/paatos?decisionId=0900908f806a5538). Tarkemmat ohjeet etäosallistumiseen liittyen toimitetaan ilmoittautumisajan päätyttyä.\r\n\r\nEsityslista: \r\nhttps://docs.google.com/document/d/1j4Jj_e5h9_rMza-zV-uYmj5cYHCHKeGbj2Pbfj48_m4/edit?usp=sharing \r\n\r\nLisätalousarvio: \r\nhttps://docs.google.com/spreadsheets/d/18q7gzuwv6VPSshG3i56jy1knfBtBBy8zBs7VvV5eJ7A/edit?usp=sharing\r\n\r\nTalousohjesäännön muutosehdotus: \r\nhttps://drive.google.com/file/d/1W47u0ZDQbxQ3wyJKKg4fZ9jX888WAGCN/view?usp=sharing\r\n\r\nMila Katajisto\r\nPuheenjohtaja\r\nTKO-äly ry\r\n\r\n****\r\n\r\nThe statutory annual spring meeting of TKO-äly is held on Tuesday, June 30th 2020 starting at 6pm in the clubroom of Christina Regina, Leppäsuonkatu 11.\r\n\r\nThe spring meeting will review the annual report and financial statements for 2019 and decide on the discharge for the board of 2019. In addition, a supplementary budget for the year 2020 and updating the financial regulations of the association will be discussed in the meeting.\r\n\r\nThe meeting will also decide on the membership fee periods and their prices for the period 2020-2021.\r\n\r\nAll TKO-äly members are welcome to the meeting. The names of the participants will be listed in the minutes of the meeting which will be available to all TKO-äly members.\r\n\r\nBased on current temporary legislation the board of TKO-äly has decided to allow remote participation during the meeting via Zoom. In addition, advance registration is required to attend the meeting. The registration opens on Tuesday, June 16th at 12:00 and closes on Tuesday, June 23rd at 18:00. More detailed instructions regarding participating remotely will be delivered after the registration has closed.\r\n\r\nAgenda (only in Finnish): \r\nhttps://docs.google.com/document/d/1j4Jj_e5h9_rMza-zV-uYmj5cYHCHKeGbj2Pbfj48_m4/edit?usp=sharing \r\n\r\nSupplementary budget (only in Finnish):\r\nhttps://docs.google.com/spreadsheets/d/18q7gzuwv6VPSshG3i56jy1knfBtBBy8zBs7VvV5eJ7A/edit?usp=sharing\r\n\r\nSugggestions for updating the financial regulations (only in Finnish):\r\n https://drive.google.com/file/d/1W47u0ZDQbxQ3wyJKKg4fZ9jX888WAGCN/view?usp=sharing\r\n\r\nMila Katajisto\r\nChair of the Board\r\nTKO-äly ry\r\n",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1746,
    "name": "Wappusitsit (TKO-älyn kiintiö)",
    "user_id": 1803,
    "created": "2020-07-16T16:32:00.000Z",
    "starts": "2020-08-07T19:00:00.000Z",
    "registration_starts": "2020-07-22T12:00:00.000Z",
    "registration_ends": "2020-08-05T19:00:00.000Z",
    "cancellation_starts": "2020-07-22T12:00:00.000Z",
    "cancellation_ends": "2020-08-05T19:00:00.000Z",
    "location": "Käärmeenpesä (Sörnäisten rantatie 33)",
    "category": "Sitsit",
    "description": "KUVAUS:\r\nWabu alkaa vihdoin! Juhlinnat aloitetaan perinteisillä Vappusitseillä perjantaina 7.8. Kaiva siis kaapista haalarit, yo-lakki ja vappumieli sekä saavu juhlimaan vuoden parhaille sitseille! Kyseessä ovat pöytäjuhlat sitsilauluilla, juomilla (saatavilla myös alkoholittomana) ja kolmen ruokalajin illallisella kokkiemme rakkaudella valmistamana.\r\n\r\nHUOM! Ethän tule sitseille jos olet yhtään flunssainen tai muuten kipeä. Poikkeuksellisesti sitsi-ilmoittautumisen voi perua vielä samana päivänä sairastapauksen sattuessa (ilmoita tällöin sitsivastaavalle asap). Hygienia pyritään varmistamaan runsaalla käsidesien saatavuudella. Mikäli Suomen koronatilanne pahenee yllättäen ennen sitsejä, tapahtuma voidaan perua kaikkien turvallisuuden takaamiseksi. Seuraamme viranomaisten ohjeistuksia asiasta.\r\n\r\nMITÄ: Wappusitsit\r\nMILLOIN: Pe 7.8. klo 19\r\nMISSÄ: Käärmeenpesä, Sörnäisten rantatie 33\r\nPUKUKOODI: haalarit ja vappuasusteet\r\nMIKSI: VIHDOIN VAPPU\r\nHINTA: 18€\r\nKENELLE: Tekis-mielisille (myös ei-jäsenet)\r\n\r\n-------\r\n\r\nVappu is here! Welcome to the legendary Sits party of 2020. Find your overalls, songbook and Vappu spirit, and come celebrate the greatest sits party of the year! The party is seated with drinks (available with or without alcohol), singing and three-course meal by our awesome chefs.\r\n\r\nDo NOT join if you have a flu or feel otherwise sick, you won't be charged if you note about your sickness prior to the party to sits responsible Minna. We will provide disinfectives and follow the regulations by authorities. The party might be cancelled if the situation with corona-virus gets worse.\r\n\r\nWHAT: Wappu Sits Party\r\nWHERE: Käärmeenpesä, Sörnäisten rantatie 33\r\nWHEN: Friday August 7th at 7pm\r\nWHY: Because it's finally Vappu\r\nDRESSCODE: overalls + fun accessories\r\nPRICE: 18€\r\nFOR WHO: TKO-äly minded people (also non-members)\r\n",
    "deleted": 0,
    "price": "18€"
  },
  {
    "id": 1756,
    "name": "PERUTTU/CANCELLED TKO-älyn 32. vuosijuhlat / 32nd annual gala",
    "user_id": 1470,
    "created": "2020-08-13T00:33:00.000Z",
    "starts": "2020-11-07T16:00:00.000Z",
    "registration_starts": "2020-09-28T12:00:00.000Z",
    "registration_ends": "2020-11-06T23:59:00.000Z",
    "cancellation_starts": "2020-09-28T12:00:00.000Z",
    "cancellation_ends": "2020-11-06T23:59:00.000Z",
    "location": "Ravintola Sipuli, Kanavaranta 7",
    "category": "Vuosijuhla",
    "description": "PERUTTU / CANCELLED\r\n\r\n\r\n---IN ENGLISH BELOW---\r\n\r\nTKO-älyn 32. vuosijuhlia vietetään tänä vuonna 7.11.2020 ravintola Sipulissa Helsingissä. Oletpa sitten fuksi, jäärä, alumni tai yhteistyökumppanimme, olet sydämellisesti tervetullut nauttimaan hyvästä ruuasta ja seurasta kanssamme!\r\n\r\nAloitamme juhlallisuudet onnitteluilla ja kuohuviinillä klo 16:00 juhlatila Käärmeenpesässä (Sörnäisten rantatie 33). Cocktail-tilaisuudesta siirrytään ravintola Sipuliin, jossa illallinen alkaa kello 18:00. Juhlan aikana nautimme maittavan menun, laulamme sitsilauluja ja kuulemme puheita.\r\n\r\nSunnuntaiaamuna halukkaille on tarjolla silliaamiainen perinteikkäällä Siltasaaren saunalla (Paasivuorenkatu 3) kello 10:30 alkaen.\r\n\r\nMenu:\r\n\r\nTryffelillä maustettua maa-artisokkakeittoa L, G sekä talon leipää L\r\n\r\n***\r\n\r\nBataatti-kikhernekroketti, paahdettua kurpitsaa ja yrttikastike M, G \r\n\r\nTAI \r\n\r\nPaahdettua helmikanan rintaa, chorizo- polentaa ja kylmää savupaprikakastiketta L, G \r\n\r\n***\r\n\r\nAppelsiinipannacotta, financier-leivos ja kaakaocrumblea L \r\n\r\n\r\n\r\nIllalliskortti jatkoineen maksaa 70 euroa TKO-älyn jäsenille ja 75 euroa ei-jäsenille. Silliaamiainen on 20 euroa. Pukukoodina frakki tai tumma puku, sekä akateemiset kunniamerkit. \r\n\r\nTänäkin vuonna vuosijuhlat huipentuvat akateemisiin tansseihin, joita varten harjoittelemme vuosijuhlaviikonloppua edeltävänä maanantaina 2.11. kello 18 alkaen Wilhelmsson-salissa (Mannerheimintie 5 A, 5. kerros).\r\n\r\nVallitsevan koronatilanteen vuoksi juhlissa noudatetaan erityistä varovaisuutta, ja pyrimme pitämään huolta sekä käsihygieniasta että riittävästä fyysisestä etäisyydestä osallistujien kesken. Juhliin osallistuvien tulee olla täysin oireettomia, ja kehotamme lämpimästi käyttämään Koronavilkkua mahdollisten altistusten havaitsemiseksi. Varaudumme myös perumaan vuosijuhlat muuttuneen koronatilanteen tai ohjeistusten niin vaatiessa. Tilannetta ja muutoksia annetuista suosituksista seurataan tiiviisti, ja mahdollisesta peruuntumisesta ilmoitetaan heti jos perumispäätös joudutaan tekemään.\r\n\r\nToivotamme Teidät lämpimästi tervetulleiksi!\r\n-----------------------------------------------------\r\n\r\nTKO-äly ry celebrates its 32nd anniversary on Saturday 7.11.2020 at restaurant Sipuli. Whether you are a fresher or a bit more advanced student, you are warmly welcome to join us and enjoy good food and even better company.\r\n\r\nThe festivities will begin with a reception at Käärmeenpesä at 4 PM (Sörnäisten rantatie 33), where sparkling wine is served and greetings for TKO-äly will be heard. Dinner will be served at Restaurant Pörssi at 6 PM. During the dinner we will enjoy a three-course meal, sing academic songs and listen to inspiring speeches.\r\n\r\nOn the next day there will be a traditional “sillis” Sunday morning brunch including sauna, snacks and some sparkling wine at Siltasaari Sauna (Paasivuorenkatu 3) starting at 10.30 AM.\r\n\r\nMenu:\r\n\r\nArtichoke soup seasoned with Truffles (L, G) and house bread (L)\r\n\r\n***\r\n\r\nSweet Potato and Chickpea Croquette, roasted Pumpkin and herb sauce (M, G)\r\n\r\nOR\r\n\r\nRoasted breast of Helmeted Guinea Fowl, Chorizo Polenta and smoked paprika sauce served cold (L, G)\r\n\r\n***\r\n\r\nPanna Cotta with orange garnish, Financier pastry and cocoa crumble (L)\r\n\r\n\r\nThe cost of participation is 70 euros for members of TKO-äly and 75 euros for other guests. The price includes the reception, dinner with drinks and the afterparty at Alina hall. The cost for the Sillis is 20 euros. Dress code: white tie or black tie and academic decorations.\r\n\r\n\r\nThis year the party culminates in a few traditional academic ballroom dances. There will be a dance rehearsal before the event, and it will be held on Monday 2.11.2020 at Wilhelmsson Hall (Mannerheimintie 5 A, 5th floor) starting at 6 PM.\r\n\r\nDue to the ongoing pandemic, we are implementing some safety measures for the Anniversary Party regarding hand hygiene and maintaining safe distance between attendees. All that are to participate in the festivities must be healthy with no symptoms of any kind. Additionally, we implore everyone to utilize the Koronavilkku application to monitor possible exposure to the virus. In the case of cancellation, please contact us at the aforementioned address as soon as possible. We are also prepared to cancel the party in the event that the situation worsens, and are following the official instructions relaid by the Finnish government and its agencies.\r\n\r\n\r\nWe hope to see you at the celebration!",
    "deleted": 0,
    "price": "75 € (Jäsen 70 €)\r\nSillis 20€"
  },
  {
    "id": 1775,
    "name": "Zoom-sitsit",
    "user_id": 2182,
    "created": "2020-11-18T14:31:50.000Z",
    "starts": "2020-12-11T18:00:00.000Z",
    "registration_starts": "2020-11-18T14:20:00.000Z",
    "registration_ends": "2020-12-11T12:00:00.000Z",
    "cancellation_starts": "2020-11-18T14:20:00.000Z",
    "cancellation_ends": "2020-12-11T12:00:00.000Z",
    "location": "Zoom",
    "category": "Sitsit",
    "description": "Esimerkkimenu on ilmestynyt!\r\nhttps://docs.google.com/document/d/1lAW721WoQ8wczxmhbBRIAKk0dm0F2ZPZEJT7hPMJoHw/edit?usp=sharing\r\n\r\n---\r\n\r\nMUUTOKSIA JÄRJESTELYSSÄ\r\n\r\nValitettavasti joudumme toteamaan, että emme pysty nykytilanteessa järjestämään sitsejä ensin aiotun suunnitelman mukaan puolilivenä. Täysin etänä sitsit kuitenkin vielä järjestetään, joten kaikki ilmottautumaan!\r\n\r\nKoska sitsit toteutetaan täysin etänä, TKO-älyn puolesta osallistujia ei jaeta fyysisiin pöytäseurueisiin. Toivomme, että osallitujat eivät itsekään muodosta fyysisiä pöytäseurueita, vaan osallistuvat vastuullisesti omista kodeistaan seuranaan korkeintaan muita samassa taloudessa asuvia.\r\n\r\nMuistakaa kuitenkin kertoa pöytäseuruetoiveenne edelleen, jotta osaamme jakaa teidät mieluisiin seurueisiin Zoomissa!\r\n\r\n---\r\n\r\nCHANGES IN ORGANIZING OF THE EVENT\r\n\r\nUnfortunately, because of the new restrictions, the sits party will be held only via Zoom.\r\n\r\nTKO-äly will not be assigning the participants to table groups for live participation, and we hope that you won't form your own table groups either and will instead participate from home.\r\n\r\nStill, we encourage you to tell us your table group preferences so we can assign you to your preferred breakout rooms in Zoom!\r\n\r\n-------------\r\n\r\n~In English below~\r\n\r\nHei rakas käpistelijä!\r\n\r\nKorona vei valitettavasti mahdollisuuden järjestää syksyn perinteiset fuksisitsit (jotka toivottavasti saadaan järjestettyä myöhemmin), mutta akuuttiin sitsaustarpeeseen on nyt ratkaisu!    \r\n      \r\nSitsit ovat perinteiset opiskelijoiden pöytäjuhlat, joissa nautitaan kolmen ruokalajin illallinen sekä juomia (joko alkoholillisena tai alkoholittomana). Sitsien pukukoodi on yleensä tavallisia opiskelijabileitä juhlavampi ja sitseillä käyttäydytään kohteliaasti. Sitsien olennainen osa ovat puheenvuorot ja laulut, joita lauletaan laulukirjoista tai tapahtumakohtaisista vihkosista.\r\n\r\nEtäsitsien pääpaikkana on Zoom ja voit osallistua täysin virtuaalisesti, mutta sitseille on mahdollisuus osallistua myös fyysisessä pöytäseurueessa (max. 10 hlöä). Tarkoituksena on vähän sekoittaa porukkaa (toki toiveita seurueen kokoonpanosta saa esittää), joten ei haittaa vaikket tuntisikaan ketään osallistujista. Huomaathan, että koronatartunnan riski on kuitenkin osallistujilla. \r\n\r\nAlla olevissa ilmoittautumistiedoissa voit ilmoittautua pöytäseurue-hostiksi, ilmoittaa kiinnostuksesi osallistua pöytäseurueeseen tai ilmoittautua etäosallistujaksi. Jos hosteja ei löydy tarpeeksi, täytyy useampien osallistua itsenäisesti etänä. Vahvistutamme hosteilla pöytäseurueensa kokoonpanon ennen sen julkistamista (ma 7.12.). Jos sinulla on valmis pöytäseurue, voit ilmoittaa teidät kaikki kerralla ja kertoa vain vapaana olevat paikat.\r\n\r\nFukseille tämä on hieno tilaisuus niin etä- kuin lähitutustustua muihin opiskelijoihin ja kokea sitsikulttuuria, joten fukseja toivotaan osallistumaan runsain määrin! Myös vanhemmat opiskelijat ovat lämpimästi tervetulleita <3\r\n\r\nKeittiömestarimme Timo Väisänen suunnittelee herkullisen, mutta helppotekoisen suositusmenun sitseille. Ruoka- ja juomahankinnat ja valmistus tapahtuu kunkin pöytäseurueen omalla vastuulla ja kustannuksella. Pöytäseurue ilmoitetaan tiistaina 8.12., jonka jälkeen voitte sopia keskenänne yksityiskohdista. Kukin pöytäseurue osallistuu sitseille Zoomin kautta.\r\n\r\nKoronaohjeiden vuoksi pöytäseurueiden koko rajoitetaan max 10 henkilöön. Pöytäseurueita kehotamme noudattamaan varovaisuutta: kukaan ei osallistu kipeänä, muistakaa käsien pesu ja desinfiointi, ja pitäkää mahdollisuuksien mukaan turvavälejä ja maskeja. Ilmoitathan pöytäseurueellesi, mikäli et pääsekään osallistumaan kipeänä olon tai karanteenin takia. Jos esim. karanteenissa haluat osallistua kuitenkin yksin etänä, ole yhteydessä järjestäjiin!\r\n\r\nJos on mitään kysyttävää tai haluat ilmoittautua osallistumaan etäyhdeydellä ilmoittautumisajan jälkeen, laita Minnalle (tg: @ihqminna) viestiä!\r\n   \r\nMITÄ: Zoom-sitsit\r\nMILLOIN: pe 11.12.2020 klo 18\r\nMISSÄ: Etäyhteydellä joko omasta kodista tai pöytäseurueen seurasta\r\nPUKUKOODI: Smart Casual\r\nMIKSI: Ikävä sitsejä <3\r\nHINTA: Riippuu omista tai pöytäseurueen ruoka- ja juomaostoksista\r\nKENELLE: Kaikille Tekis-mielisille (myös ei-jäsenet)\r\n\r\n\r\nDear Computer Scientist,\r\n\r\nUnfortunately the traditional freshmen sits party cannot be held this Fall due to COVID-19, but we hope to organize it sometime soon. Instead, we are organizing a distance sits party! You are warmly welcome, whether you are a freshman, older student, exchange student, or something else.\r\n\r\nSits party is a seated celebration with three-course meal and drinks (either with alcohol or non-alcoholic). At sits parties we sing traditional student songs, make toasts and enjoy the atmosphere. One dresses usually up a bit more formally to sits parties, yet they are relaxed events.\r\n\r\nThe sits will be held in Zoom and you can take part even virtually, or within a physical table company (with max. 10 ppl). We hope to mix people, so you can enroll even if you don’t know anyone attending. Kindly note, that if you join a table company, the risk of COVID-19 contagion is on you. Below you can enroll either attending virtually, to attend a table company or to host a table company. If there is not enough hosts, we will randomly pick attendees for the table companies, and others will need to join virtually.\r\n\r\nOur chef will plan a delicious, yet easy to make dinner for the sits party. Each attendee, either alone or with their table company is responsible for buying their own drinks and cooking their dinner. The table companies will be announced on Tuesday the 8th, after which you can agree on the details. Each table company attends the sits party via Zoom.\r\n\r\nBecause of the COVID-19 situation, we limit the table companies to max 10 people. We encourage you to take adequate safety actions: wash and disinfect hands frequently. Consider also having safe distances (if possible) and mask usage. Kindly inform your table company if you can’t attend if you get sick or are assigned to quarantine. If you are in quarantine, you can still attend from home, kindly contact the organizers in that case.\r\n\r\nIf you have any questions or wish to enroll after as a home attendee after the registration time, kindly message Minna (tg: @ihqminna).\r\n\r\nWHAT: Sits party in Zoom\r\nWHEN: Fri December 11th 2020 at 6pm\r\nWHERE: Either from home or with a table company via Zoom\r\nDRESSCODE: Smart Casual\r\nWHY: Long time no sits party ☹\r\nPRICE: Depends on the food and drinks you or your table company buys\r\nFOR WHO: All TKO-äly minded people (also non-members)",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1825,
    "name": "Pikniksitsit",
    "user_id": 2383,
    "created": "2021-06-29T22:33:40.000Z",
    "starts": "2021-07-10T18:00:00.000Z",
    "registration_starts": "2021-06-30T12:00:00.000Z",
    "registration_ends": "2021-07-08T20:00:00.000Z",
    "cancellation_starts": "2021-06-30T12:00:00.000Z",
    "cancellation_ends": "2021-07-08T20:00:00.000Z",
    "location": "Väinämöisen puisto, Etu-Töölö",
    "category": "Sitsit",
    "description": "Pikniksitsit\r\n\r\nTaas on aika kaivaa laulukirja esiin, sillä tarkoituksenamme on sitsata! Koska on kesä ja jokin ihme viirus on karsinut sisätapahtumia viime aikoina, sitsaamme tällä kertaa ulkosalla piknikin merkeissä.\r\n\r\nTarjolla on tavalliseen tapaan kolmen ruokalajin ateria oman valinnan mukaan lihalla tai kasvisversiona. Aterian kanssa tarjoillaan kaksi kaatoa viiniä, snapsi ja kahvi avecilla sekä tietenkin vettä. Järjestäjien toimesta tarjolla ei ole muita juomia, mutta omia juomia voi tuoda lisäksi.\r\n\r\nPukukoodina on sään mukainen puistovaatetus, kuten haalarit. Huomioithan mahdollisen auringonpaisteen, kosteuden, päivän lämmön, illan viileyden…\r\n\r\nPienen sateen emme anna haitata sitsaamista, mutta mikäli sääennuste lupaa kovempaa sadetta, niin sitsit voidaan siirtää tai perua. Seuraamme myös koronavirustilannetta ja tarvittaessa toimimme sen mukaan.\r\n\r\nEthän tule sitseille oireisena tai jos olet tai sinun tulisi olla (omaehtoisessa) karanteenissa. Ole yhteydessä järjestäjään, jos osallistumisesi peruuntuu tästä syystä.\r\n\r\nIlmottautuneille on Telegram-ryhmä osoitteessa https://t.me/joinchat/0WZwOLwMpjo2ODlk. Tarkka tapahtumapaikka ilmoitetaan siellä.\r\n\r\n---\r\n\r\nPicnic Sitsit\r\n\r\nIt’s time to dig up your song book because we are going to have a sitsit again! Because it is summer and indoor activities are not such a good idea because of some kind of a virus, we are going to have our sitsit outside and have a picnic.\r\n\r\nThere will be a three-course dinner with meat or vegetables according to your choice, as usual. Two glasses of wine, schnapps and café avec will be served with the dinner, as will be water too, of course. Other drinks will not be served by the organizers, but you are welcome to bring your own drinks.\r\n\r\nDress code is anything appropriate for the weather and a park, like overalls. Please take into consideration the possibility of the sun shining, humidity, warmth of the day, coldness of the night…\r\n\r\nWe are not going to let a little rain stop us from having a sitsit. If the weather forecast predicts heavier rain, the sitsit can be postponed or cancelled. We will follow the corona virus situation and act on it if needed.\r\n\r\nPlease do not come to the sitsit if you have symptoms or if you are or you should be in quarantine. Contact the organizer if you have to cancel your participation because of this.\r\n\r\nThere is a Telegram-group for the participants https://t.me/joinchat/0WZwOLwMpjo2ODlk. The exact place of the event is going to be announced there.",
    "deleted": 0,
    "price": "13€"
  },
  {
    "id": 1830,
    "name": "Fuksisitsit2020 // Vanhojen ilmo",
    "user_id": 2383,
    "created": "2021-07-29T17:23:38.000Z",
    "starts": "2021-08-07T18:00:00.000Z",
    "registration_starts": "2021-07-30T12:00:00.000Z",
    "registration_ends": "2021-08-06T18:00:00.000Z",
    "cancellation_starts": "2021-07-30T12:00:00.000Z",
    "cancellation_ends": "2021-08-06T18:00:00.000Z",
    "location": "Käärmeenpesä (Sörnäisten rantatie 33)",
    "category": "Sitsit",
    "description": "Sitsit, eli akateemiset pöytäjuhlat, ovat tärkeä osa pohjoismaista yliopistokulttuuria. Lyhyesti sanottuna sitseillä pukeudutaan hienosti, syödään sekä juodaan, ja viimeisimpänä, muttei vähäisimpänä, lauletaan.\r\n\r\nFuksit saapuvat sitsaamaan ensimmäistä kertaa, ja vanhempien opiskelijoiden olisi suotavaa näyttää hyvää esimerkkiä ja opettaa fuksit käyttäytymään sitsisääntöjen mukaisesti.\r\n\r\nTapahtuman on tarkoitus olla oppimiskokemus fukseille, eli varauduthan käyttäytymään ihan oikeasti kunnolla.\r\n\r\nVuoden 2020 fuksien ja tuutoreiden palkitseminen on lykkääntynyt, joten se tapahtuu myös näillä sitseillä.\r\n\r\nSitsien jälkeen jatkot samassa osoitteessa!\r\n\r\nEthän tule sitseille oireisena tai jos olet tai sinun tulisi olla (omaehtoisessa) karanteenissa. Ole yhteydessä järjestäjään, jos osallistumisesi peruuntuu tästä syystä.\r\n\r\n--\r\n\r\nSitsit (academic table parties) has an important role in Finnish university culture. In short: we dress up nicely, we eat and drink, and last but not the least, we sing.\r\n\r\nThis will be the first sitsit for freshers, so older students should act as role models and teach freshers the proper etiquette.\r\n\r\nThe event is supposed to be a learning experience for the freshers, so really: be on your best behaviour.\r\n\r\nRewarding of the freshers and tutors of 2020 has been postponed, so it will be done at the sitsit too.\r\n\r\nAfter party in the same address!\r\n\r\nPlease do not come to the sitsit if you have symptoms or if you are or you should be in quarantine. Contact the organizer if you have to cancel your participation because of this.\r\n",
    "deleted": 0,
    "price": "15€"
  },
  {
    "id": 1867,
    "name": "Syyssitsit",
    "user_id": 2383,
    "created": "2021-10-14T18:02:25.000Z",
    "starts": "2021-10-24T18:00:00.000Z",
    "registration_starts": "2021-10-17T18:00:00.000Z",
    "registration_ends": "2021-10-23T18:00:00.000Z",
    "cancellation_starts": "2021-10-17T18:00:00.000Z",
    "cancellation_ends": "2021-10-23T18:00:00.000Z",
    "location": "Alina-sali, Mannerheimintie 5 A, 3. krs",
    "category": "Sitsit",
    "description": "Pitkästä aikaa tervetuloa kaikille jäsenille avoimille, sisällä järjestettäville sitseille! Sitsit järjestetään vanhalla tutulla Alinalla. Tule siis sinne nauttimaan tarjoiluista, laulamaan yhdessä sekä katsomaan, miltä ne muut vanhat tutut näyttivätkään tai mitä uusia tuttavuuksia löytyy!\r\n\r\n\r\nMITÄ: Syyssitsit\r\nMISSÄ: Alina-sali, Mannerheimintie 5 A, 3. kerros\r\nMILLOIN: Su 24.10. klo 18\r\nPUKUKOODI: Smart Casual (siisti pukeutuminen, esim. kauluspaita)\r\nHINTA: 15 €\r\nTELEGRAM: https://t.me/joinchat/nMwQp1tlM0w5OTM0\r\n\r\n<h3>Autumn sitsit</h3>\r\n\r\nIt’s been a long time since the last sitsit which has been inside and meant for everyone. That’s why welcome to Autumn sitsit! Sitsit will be held in the old good Alina hall. Come to enjoy the food and drinks, to sing together and to see, how your old friends look like or to make new ones!\r\n\r\nWHAT: Autumn sitsit\r\nWHERE: Alina hall, Mannerheimintie 5 A, 3rd floor\r\nWHEN: Sunday 24 October, 6pm\r\nDRESSCODE: Smart Casual\r\nPRICE: 15€\r\nTELEGRAM: https://t.me/joinchat/nMwQp1tlM0w5OTM0\r\n",
    "deleted": 0,
    "price": "15 €"
  },
  {
    "id": 1888,
    "name": "TKO-älyn sääntömääräinen syyskokous // TKO-äly statutory autumn general assembly",
    "user_id": 1803,
    "created": "2021-11-12T16:31:26.000Z",
    "starts": "2021-11-24T14:00:00.000Z",
    "registration_starts": "2021-11-16T23:59:00.000Z",
    "registration_ends": "2021-11-24T13:30:00.000Z",
    "cancellation_starts": "2021-11-16T23:59:00.000Z",
    "cancellation_ends": "2021-11-24T13:30:00.000Z",
    "location": "Chemicum A129, A.I. Virtasen aukio 1",
    "category": "Kokous",
    "description": "--- IN ENGLISH BELOW ---\r\n\r\nOn tullut taas se aika vuodesta, kun jäsenistö pääsee äänestämään tulevan vuoden luottamushenkilöistä! Luethan alla olevat ohjeet HUOLELLISESTI, jotta kokoukseen osallistuminen ja itse kokouksen kulku toteutuu mahdollisimman kivuttomasti.\r\n\r\nTKO-älyn sääntömääräinen syyskokous pidetään 24.11. klo 14.00 alkaen Kumpulan kampuksella luentosalissa Chemicum A129 sekä Zoomissa. Suosittelemme ensisijaisesti tulemaan fyysisesti paikalle. Hallitus on kuitenkin päättänyt, että tilaisuuteen voi myös osallistua etäyhteyden välityksellä ja että ääntä voi käyttää asiamiehen välityksellä. Tapahtumaan TULEE ILMOITTAUTUA ETUKÄTEEN.\r\n\r\nKokouksessa valitaan vuodelle 2022 puheenjohtaja, rahastonhoitaja, sihteeri, hallitus sekä muut esityslistassa mainitut virkailijat. Virkoihin voi asettua ehdolle kokouksessa tai toimittamalla allekirjoitetun valtakirjan sähköisesti osoitteeseen pj@tko-aly.fi tai Telegramissa (@myzozoz). Mikäli et pääse osallistumaan kokoukseen, voit halutessasi toimittaa valtakirjan mukana myös lyhyen hakemusvideon, jossa kerrot mitä virkaa/virkoja haet ja miksi. Alustavan kiinnostuksen eri virkoihin voi ilmaista https://wiki.tko-aly.fi/Aktiiviehdokkaat_vuodelle_2022 (kirjautuminen jäsentunnuksilla).\r\n\r\nLisäksi kokouksessa käsitellään vuoden 2022 toimintasuunnitelma ja talousarvio. Toimintasuunnitelmaan ja talousarvioon tulee olemaan mahdollisuus tutustua etukäteen, jottei niitä tarvitse käydä kokonaisuudessaan kokouksessa läpi.\r\n\r\nKokoukseen ovat tervetulleita kaikki TKO-älyn jäsenet ja kaikilla yhdistyksen jäsenillä on yhdistyksen kokouksissa puheoikeus. Äänioikeus on VAIN yhdistyksen varsinaisilla jäsenillä. Tänä ja viime syksyinä jäsenpalvelussa on todettu häikkää. Käy siis katsomassa, että sinulla on oikea jäsenstatus kirjautumalla sisään ja menemällä jäsentietoihin. Jos tiedot ovat väärin, ota yhteyttä jasenvastaava@tko-aly.fi.\r\n\r\nKokouksen jälkeen on sauna.\r\n\r\nEsityslista: https://drive.google.com/file/d/1-8RHjVxojOYKsQUi73vRs0za8b13SSjv/view?usp=sharing\r\nValtakirjapohja: https://drive.google.com/file/d/1-Aa4MdFNaYvqgvACSGxhereU9-258v4O/view?usp=sharing\r\nToimintasuunnitelma: https://drive.google.com/file/d/1V3I5ejQK0wQMApzgXuvtNwC67izwhX-V/view?usp=sharing \r\nTalousarvio: https://docs.google.com/spreadsheets/d/1CItvjAJaDDMEZxmvfdIEX-XYp0otV4xZZc7G54RRZ1k/edit?usp=sharing\r\n\r\nMarkus Holopainen\r\nPuheenjohtaja\r\nTKO-äly ry\r\n\r\n-----------\r\n\r\nTKO-äly's statutory autumn meeting is held on Wednesday, November 24th 2021 starting at 2pm in the lecture room Chemicum A129 at the Kumpula Campus (A.I. Virtasen aukio). Remote attendance will be made possible. Participation via delegate will also be made possible. REGISTRATION TO THE EVENT IS MANDATORY.\r\n\r\nThe meeting will decide on the chair of the board, treasurer, secretary, the board and other officers mentioned in the agenda attached for the year 2022. If you wish to run for a position, please attend the meeting or send a signed mandate to your preferred position(s) via email pj@tko-aly.fi or Telegram (@myzozoz). If you’re unable to attend, you can also send a short video application with the mandate. Please notice that we will show video applications only if there is time to do so.\r\n\r\nIn addition we will review the strategy and budget for the year 2021. The documents will be made available before hand, so we don't have to go through them in their entirety in the meeting. \r\n\r\nAll TKO-äly members are welcome to the meeting with the right to speak. Only those with full membership are able to vote, though. There have been known to be bugs in the membership system, so please make sure that your member info is correct. If there are problems with these, contact jasenvastaava@tko-aly.fi. Please arrive early since we have a lot to discuss.\r\n\r\nThere will be sauna.\r\n\r\nAgenda: https://drive.google.com/file/d/1-8RHjVxojOYKsQUi73vRs0za8b13SSjv/view?usp=sharing\r\nExample mandate: https://drive.google.com/file/d/1-Aa4MdFNaYvqgvACSGxhereU9-258v4O/view?usp=sharing\r\nStrategy: https://drive.google.com/file/d/1V3I5ejQK0wQMApzgXuvtNwC67izwhX-V/view?usp=sharing \r\nBudget: https://docs.google.com/spreadsheets/d/1CItvjAJaDDMEZxmvfdIEX-XYp0otV4xZZc7G54RRZ1k/edit?usp=sharing\r\n\r\n\r\nMarkus Holopainen\r\nChair of the board\r\nTKO-äly ry",
    "deleted": 0,
    "price": ""
  },
  {
    "id": 1895,
    "name": "Ylimääräinen yhdistyksen kokous (12/2021) // Extra general assembly (12/2021)",
    "user_id": 1803,
    "created": "2021-12-02T10:34:40.000Z",
    "starts": "2021-12-09T16:00:00.000Z",
    "registration_starts": "2021-12-02T10:35:00.000Z",
    "registration_ends": "2021-12-09T15:30:00.000Z",
    "cancellation_starts": "2021-12-02T10:35:00.000Z",
    "cancellation_ends": "2021-12-09T15:30:00.000Z",
    "location": "Kokoushuone, Christina Regina, Leppäsuonkatu 11",
    "category": "Kokous",
    "description": "--- IN ENGLISH BELOW ---\r\n\r\nHei kaikille!\r\n\r\nViime viikon syyskokouksessa suoritettiin osa virkailijavalinnoista TKO-älyn sääntöjen vastaisesti. Tästä syystä hallitus on päättänyt kutsua koolle ylimääräisen yhdistyksen kokouksen, jossa kiistanalaiset tulokset mitätöidään ja vaalit järjestetään uudelleen. Uusintavaaleissa ehdokasasettelu on auki kaikille kriteerit täyttäville jäsenille. Mitätöitäviä valintoja ovat ainakin pj-, sihteeri- ja jäsenvastaavavalinnat.\r\n\r\nKokous järjestetään torstaina 9.12. klo 16.00 alkaen Christina Reginan kokoushuoneessa, osoitteessa Leppäsuonkatu 11.\r\n\r\nKokouksessa 25/2021 hallitus on päättänyt, että tilaisuuteen sallitaan osallistuminen etäyhteyksin, että ennakkoilmoittautumista vaaditaan ja että äänestyksissä on mahdollista käyttää asiamiestä. Etäosallistumista suositellaan kaikille, joille moinen on vaihtoehto, tilan rajallisen kapasiteetin takia.\r\n\r\nEsityslista: https://drive.google.com/file/d/1ftRg3mR3l5ivKqL-YX9BFia27dwFbldF/view?usp=sharing\r\n\r\nyt,\r\nMarkus Holopainen\r\nPuheenjohtaja\r\nTKO-äly ry\r\n\r\n---------\r\n\r\nHi everybody!\r\n\r\nSome of the elections during last week's autumn meeting were conducted using incorrect methods. Due to this the board has decided to summon an extra general assembly, where the election results in question are overruled and new elections are held. In the new elections all members who meet the electability criteria have a chance to apply. Positions for which re-elections must be held are the chair of the board, secretary and member coordinator.\r\n\r\nThe meeting will be held on Thursday December 9th at 4:00 pm in the meeting room of Christina Regina, Leppäsuonkatu 11.\r\n\r\nIn the meeting 25/2021 the board has ruled that remote participation will be allowed, registration for the event is mandatory and voting via delegate is allowed. Remote participation is encouraged, if possible, due to the lacking capacity of the meeting room.\r\n\r\nAgenda: https://drive.google.com/file/d/1ftRg3mR3l5ivKqL-YX9BFia27dwFbldF/view?usp=sharing\r\n\r\nbr,\r\nMarkus Holopainen\r\nChair of the Board\r\nTKO-äly ry",
    "deleted": 0,
    "price": ""
  }
]
